Repository: z1996xm/BIGTREETECH_translations
Catalog: locales/*/LC_MESSAGES/Endstop_Phase.po
Languages: fr

source: This document describes Klipper's stepper phase adjusted endstop system. This functionality can improve the accuracy of traditional endstop switches. It is most useful when using a Trinamic stepper motor driver that has run-time configuration.
fr: Ce document décrit le système de butée ajustée en phase pas à pas de Klipper. Cette fonctionnalité peut améliorer la précision des interrupteurs de fin de course traditionnels. Il est particulièrement utile lors de l'utilisation d'un pilote de moteur pas à pas Trinamic doté d'une configuration d'exécution.

source: A typical endstop switch has an accuracy of around 100 microns. (Each time an axis is homed the switch may trigger slightly earlier or slightly later.) Although this is a relatively small error, it can result in unwanted artifacts. In particular, this positional deviation may be noticeable when printing the first layer of an object. In contrast, typical stepper motors can obtain significantly higher precision.
fr: Un interrupteur de fin de course standard a une précision d'environ 100 microns. (Chaque fois qu'un axe est référencé, le commutateur peut se déclencher légèrement plus tôt ou légèrement plus tard.) Bien qu'il s'agisse d'une erreur relativement petite, elle peut entraîner des artefacts indésirables. En particulier, cet écart de position peut être perceptible lors de l'impression de la première couche d'un objet. En revanche, les moteurs pas à pas standard peuvent obtenir une précision nettement supérieure.

source: The stepper phase adjusted endstop mechanism can use the precision of the stepper motors to improve the precision of the endstop switches. A stepper motor moves by cycling through a series of phases until in completes four "full steps". So, a stepper motor using 16 micro-steps would have 64 phases and when moving in a positive direction it would cycle through phases: 0, 1, 2, ... 61, 62, 63, 0, 1, 2, etc. Crucially, when the stepper motor is at a particular position on a linear rail it should always be at the same stepper phase. Thus, when a carriage triggers the endstop switch the stepper controlling that carriage should always be at the same stepper motor phase. Klipper's endstop phase system combines the stepper phase with the endstop trigger to improve the accuracy of the endstop.
fr: Le mécanisme de butée à ajustement de phase peut utiliser la précision des moteurs pas à pas pour améliorer la précision des interrupteurs de butée. Un moteur pas à pas se déplace en suivant une série de phase jusqu'à ce qu'il effectue quatre "étapes complètes". Ainsi, un moteur pas à pas utilisant 16 micro-pas aura 64 phases et lorsqu'il se déplace dans le sens positif, il passera par phases : 0, 1, 2, ... 61, 62, 63, 0, 1, 2, etc. Surtout, lorsque le moteur pas à pas se trouve à une position particulière sur un rail linéaire, il doit toujours être à la même phase. Ainsi, lorsqu'un chariot déclenche l'interrupteur de fin de course, le moteur pas à pas contrôlant ce chariot doit toujours être à la même phase du moteur pas à pas. Le système de phase d'arrêt final de Klipper combine la phase pas à pas avec le déclencheur d'arrêt final pour améliorer la précision de l'arrêt final.

source: In order to use this functionality it is necessary to be able to identify the phase of the stepper motor. If one is using Trinamic TMC2130, TMC2208, TMC2224 or TMC2660 drivers in run-time configuration mode (ie, not stand-alone mode) then Klipper can query the stepper phase from the driver. (It is also possible to use this system on traditional stepper drivers if one can reliably reset the stepper drivers - see below for details.)
fr: Pour utiliser cette fonctionnalité, il est nécessaire de pouvoir identifier la phase du moteur pas à pas. Si l'on utilise les pilotes Trinamic TMC2130, TMC2208, TMC2224 ou TMC2660 en mode de configuration d'exécution (c'est-à-dire pas en mode autonome - "standalone"), Klipper peut interroger la phase pas à pas du pilote. (Il est également possible d'utiliser ce système sur des pilotes pas à pas traditionnels si l'on peut réinitialiser de manière fiable ces pilotes pas à pas - voir ci-dessous pour plus de détails.)

source: Calibrating endstop phases
fr: Étalonnage des phases de fin de course

source: If using Trinamic stepper motor drivers with run-time configuration then one can calibrate the endstop phases using the ENDSTOP_PHASE_CALIBRATE command. Start by adding the following to the config file:
fr: Si vous utilisez des pilotes de moteur pas à pas Trinamic avec une configuration d'exécution, vous pouvez calibrer les phases de fin de course à l'aide de la commande ENDSTOP_PHASE_CALIBRATE. Commencez par ajouter les éléments suivants au fichier de configuration :

source: Then RESTART the printer and run a `G28` command followed by an `ENDSTOP_PHASE_CALIBRATE` command. Then move the toolhead to a new location and run `G28` again. Try moving the toolhead to several different locations and rerun `G28` from each position. Run at least five `G28` commands.
fr: Redémarrez ensuite l'imprimante et exécutez une commande `G28` suivie d'une commande `ENDSTOP_PHASE_CALIBRATE`. Déplacez ensuite la tête d'outil vers un nouvel emplacement et exécutez à nouveau `G28`. Essayez de déplacer la tête d'outil à plusieurs endroits différents et réexécutez `G28` à partir de chaque position. Exécutez au moins cinq commandes `G28`.

source: After performing the above, the `ENDSTOP_PHASE_CALIBRATE` command will often report the same (or nearly the same) phase for the stepper. This phase can be saved in the config file so that all future G28 commands use that phase. (So, in future homing operations, Klipper will obtain the same position even if the endstop triggers a little earlier or a little later.)
fr: Après avoir effectué ce qui précède, la commande `ENDSTOP_PHASE_CALIBRATE` signalera souvent la même (ou presque la même) phase pour le stepper. Cette phase peut être enregistrée dans le fichier de configuration afin que toutes les futures commandes G28 utilisent cette phase. (Ainsi, dans les futures opérations de prise d'origine, Klipper obtiendra la même position même si la butée se déclenche un peu plus tôt ou un peu plus tard.)

source: To save the endstop phase for a particular stepper motor, run something like the following:
fr: Pour enregistrer la phase d'arrêt final d'un moteur pas à pas particulier, exécutez quelque chose comme ceci :

source: Run the above for all the steppers one wishes to save. Typically, one would use this on stepper_z for cartesian and corexy printers, and for stepper_a, stepper_b, and stepper_c on delta printers. Finally, run the following to update the configuration file with the data:
fr: Exécutez ce qui précède pour tous les steppers que vous souhaitez enregistrer. En règle générale, on l'utiliserait sur stepper_z pour les imprimantes cartésiennes et corexy, et pour stepper_a, stepper_b et stepper_c sur les imprimantes delta. Enfin, exécutez la commande suivante pour mettre à jour le fichier de configuration avec les données :

source: Additional notes
fr: Notes complémentaires

source: This feature is most useful on delta printers and on the Z endstop of cartesian/corexy printers. It is possible to use this feature on the XY endstops of cartesian printers, but that isn't particularly useful as a minor error in X/Y endstop position is unlikely to impact print quality. It is not valid to use this feature on the XY endstops of corexy printers (as the XY position is not determined by a single stepper on corexy kinematics). It is not valid to use this feature on a printer using a "probe:z_virtual_endstop" Z endstop (as the stepper phase is only stable if the endstop is at a static location on a rail).
fr: Cette fonctionnalité est particulièrement utile sur les imprimantes delta et sur la butée Z des imprimantes cartésiennes/corexy. Il est possible d'utiliser cette fonctionnalité sur les butées XY des imprimantes cartésiennes, mais cela n'est pas particulièrement utile car une erreur mineure dans la position de la butée X/Y n'aura probablement pas d'impact sur la qualité d'impression. Il n'est pas valide d'utiliser cette fonctionnalité sur les butées XY des imprimantes corexy (car la position XY n'est pas déterminée par un seul stepper sur la cinématique corexy). Il n'est pas valide d'utiliser cette fonctionnalité sur une imprimante utilisant une butée Z "probe:z_virtual_endstop" (car la phase pas à pas n'est stable que si la butée se trouve à un emplacement statique sur un rail).

source: After calibrating the endstop phase, if the endstop is later moved or adjusted then it will be necessary to recalibrate the endstop. Remove the calibration data from the config file and rerun the steps above.
fr: Après avoir calibré la phase de butée, si la butée est déplacée ou ajustée ultérieurement, il sera nécessaire de recalibrer la butée. Supprimez les données d'étalonnage du fichier de configuration et réexécutez les étapes ci-dessus.

source: In order to use this system the endstop must be accurate enough to identify the stepper position within two "full steps". So, for example, if a stepper is using 16 micro-steps with a step distance of 0.005mm then the endstop must have an accuracy of at least 0.160mm. If one gets "Endstop stepper_z incorrect phase" type error messages than in may be due to an endstop that is not sufficiently accurate. If recalibration does not help then disable endstop phase adjustments by removing them from the config file.
fr: Pour utiliser ce système, la butée doit être suffisamment précise pour identifier la position du stepper en deux "pas complets". Ainsi, par exemple, si un stepper utilise 16 micro-pas avec une distance de pas de 0,005 mm, la butée doit avoir une précision d'au moins 0,160 mm. Si l'on obtient des messages d'erreur de type "Endstop stepper_z incorrect phase", cela peut être dû à un endstop qui n'est pas suffisamment précis. Si le recalibrage n'aide pas, désactivez les ajustements de phase de butée en les supprimant du fichier de configuration.

source: If one is using a traditional stepper controlled Z axis (as on a cartesian or corexy printer) along with traditional bed leveling screws then it is also possible to use this system to arrange for each print layer to be performed on a "full step" boundary. To enable this feature be sure the G-Code slicer is configured with a layer height that is a multiple of a "full step", manually enable the endstop_align_zero option in the endstop_phase config section (see [config reference](Config_Reference.md#endstop_phase) for further details), and then re-level the bed screws.
fr: Si l'on utilise un axe Z traditionnel contrôlé par pas à pas (comme sur une imprimante cartésienne ou corexy) avec des vis de nivellement de lit traditionnelles, il est également possible d'utiliser ce système pour faire en sorte que chaque couche d'impression soit effectuée sur une limite "pas complet" . Pour activer cette fonctionnalité, assurez-vous que le slicer G-Code est configuré avec une hauteur de couche qui est un multiple d'un "pas complet", activez manuellement l'option endstop_align_zero dans la section de configuration endstop_phase (voir [reference de configuration](Config_Reference.md#endstop_phase) pour plus de détails), puis remettez à niveau les vis du lit.

source: It is possible to use this system with traditional (non-Trinamic) stepper motor drivers. However, doing this requires making sure that the stepper motor drivers are reset every time the micro-controller is reset. (If the two are always reset together then Klipper can determine the stepper phase by tracking the total number of steps it has commanded the stepper to move.) Currently, the only way to do this reliably is if both the micro-controller and stepper motor drivers are powered solely from USB and that USB power is provided from a host running on a Raspberry Pi. In this situation one can specify an mcu config with "restart_method: rpi_usb" - that option will arrange for the micro-controller to always be reset via a USB power reset, which would arrange for both the micro-controller and stepper motor drivers to be reset together. If using this mechanism, one would then need to manually configure the "trigger_phase" config sections (see [config reference](Config_Reference.md#endstop_phase) for the details).
fr: Il est possible d'utiliser ce système avec des pilotes de moteurs pas à pas traditionnels (non Trinamic). Cependant, cela nécessite de s'assurer que les pilotes du moteur pas à pas sont réinitialisés à chaque fois que le microcontrôleur est réinitialisé. (Si les deux sont toujours réinitialisés ensemble, Klipper peut déterminer la phase du moteur pas à pas en suivant le nombre total de pas qu'il a commandé au moteur pas à pas.) Actuellement, la seule façon de le faire de manière fiable est que le microcontrôleur et le moteur pas à pas les pilotes soient alimentés uniquement par USB et que l'alimentation USB soit fournie par un hôte fonctionnant sur un Raspberry Pi. Dans cette situation, on peut spécifier une configuration mcu avec "restart_method : rpi_usb" - cette option fera en sorte que le microcontrôleur soit toujours réinitialisé via une réinitialisation de l'alimentation USB, ce qui permettrait à la fois au microcontrôleur et aux pilotes de moteur pas à pas d'être réinitialiser ensemble. Si vous utilisez ce mécanisme, vous devrez alors configurer manuellement les sections de configuration "trigger_phase" (voir [config reference](Config_Reference.md#endstop_phase) pour les détails).

source: Endstop phase
fr: Phase de fin de course
