Repository: z1996xm/BIGTREETECH_translations
Catalog: locales/*/LC_MESSAGES/MCU_Commands.po
Languages: fr

source: `queue_step oid=%c interval=%u count=%hu add=%hi` : This command schedules 'count' number of steps for the given stepper, with 'interval' number of clock ticks between each step. The first step will be 'interval' number of clock ticks since the last scheduled step for the given stepper. If 'add' is non-zero then the interval will be adjusted by 'add' amount after each step. This command appends the given interval/count/add sequence to a per-stepper queue. There may be hundreds of these sequences queued during normal operation. New sequence are appended to the end of the queue and as each sequence completes its 'count' number of steps it is popped from the front of the queue. This system allows the micro-controller to queue potentially hundreds of thousands of steps - all with reliable and predictable schedule times.
fr: `queue_step oid=%c interval=%u count=%hu add=%hi` : cette commande planifie le nombre de pas 'count' pour le stepper donné, avec un nombre 'd'intervalle' de ticks d'horloge entre chaque pas. La première étape sera le nombre "d'intervalle" de ticks d'horloge depuis la dernière étape planifiée pour le stepper donné. Si 'add' n'est pas nul, l'intervalle sera ajusté du montant 'add' après chaque pas. Cette commande ajoute la séquence d'intervalle/compte/ajout donnée à une file d'attente des pas. Il peut y avoir des centaines de ces séquences en file d'attente pendant le fonctionnement normal. Une nouvelle séquence est ajoutée à la fin de la file d'attente et lorsque chaque séquence termine son nombre de pas, elle est retirée du début de la file d'attente. Ce système permet au microcontrôleur de mettre en file d'attente potentiellement des centaines de milliers d'étapes, le tout avec des durées fiables et prévisibles.

source: `set_next_step_dir oid=%c dir=%c` : This command specifies the value of the dir_pin that the next queue_step command will use.
fr: `set_next_step_dir oid=%c dir=%c` : Cette commande spécifie la valeur du dir_pin que la prochaine commande queue_step utilisera.

source: `reset_step_clock oid=%c clock=%u` : Normally, step timing is relative to the last step for a given stepper. This command resets the clock so that the next step is relative to the supplied 'clock' time. The host usually only sends this command at the start of a print.
fr: `reset_step_clock oid=%c clock=%u` : Normalement, la synchronisation des pas est relative au dernier pas pour un stepper donné. Cette commande réinitialise l'horloge de sorte que l'étape suivante soit relative à l'heure "horloge" fournie. L'hôte n'envoie généralement cette commande qu'au début d'une impression.

source: `stepper_get_position oid=%c` : This command causes the micro-controller to generate a "stepper_position" response message with the stepper's current position. The position is the total number of steps generated with dir=1 minus the total number of steps generated with dir=0.
fr: `stepper_get_position oid=%c` : Cette commande amène le microcontrôleur à générer un message de réponse "stepper_position" avec la position actuelle du stepper. La position est le nombre total d'étapes générées avec dir=1 moins le nombre total d'étapes générées avec dir=0.

source: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : This command is used during stepper "homing" operations. To use this command a 'config_endstop' command with the same 'oid' parameter must have been issued during micro-controller configuration. When this command is invoked, the micro-controller will sample the endstop pin every 'rest_ticks' clock ticks and check if it has a value equal to 'pin_value'. If the value matches (and it continues to match for 'sample_count' additional samples spread 'sample_ticks' apart) then the movement queue for the associated stepper will be cleared and the stepper will come to an immediate halt. The host uses this command to implement homing - the host instructs the endstop to sample for the endstop trigger and then it issues a series of queue_step commands to move a stepper towards the endstop. Once the stepper hits the endstop, the trigger will be detected, the movement halted, and the host notified.
fr: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : Cette commande est utilisée lors des opérations de "homing" des moteurs pas à pas. Pour utiliser cette commande, une commande 'config_endstop' avec le même paramètre 'oid' doit avoir été émise lors de la configuration du microcontrôleur. Lorsque cette commande est invoquée, le microcontrôleur échantillonnera la broche endstop à chaque tic d'horloge 'rest_ticks' et vérifiera si elle a une valeur égale à 'pin_value'. Si la valeur correspond (et continue de correspondre pour 'sample_count' échantillons supplémentaires répartis 'sample_ticks'), alors la file d'attente de mouvement pour le stepper associé sera effacée et le stepper s'arrêtera immédiatement. L'hôte utilise cette commande pour implémenter la prise d'origine - l'hôte demande à la butée d'échantillonner pour le déclencheur de butée, puis il émet une série de commandes queue_step pour déplacer un stepper vers la butée. Une fois que le stepper atteint la butée, le déclencheur sera détecté, le mouvement arrêté et l'hôte notifié.

source: Move queue
fr: Déplacer la file d'attente

source: Each queue_step command utilizes an entry in the micro-controller "move queue". This queue is allocated when it receives the "finalize_config" command, and it reports the number of available queue entries in "config" response messages.
fr: Chaque commande queue_step utilise une entrée dans la "file d'attente de déplacement" du microcontrôleur. Cette file d'attente est allouée lorsqu'elle reçoit la commande "finalize_config", et elle signale le nombre d'entrées de file d'attente disponibles dans les messages de réponse "config".

source: It is the responsibility of the host to ensure that there is available space in the queue before sending a queue_step command. The host does this by calculating when each queue_step command completes and scheduling new queue_step commands accordingly.
fr: Il est de la responsabilité de l'hôte de s'assurer qu'il y a de l'espace disponible dans la file d'attente avant d'envoyer une commande queue_step. Pour ce faire, l'hôte calcule le moment où chaque commande queue_step se termine et planifie de nouvelles commandes queue_step en conséquence.

source: SPI Commands
fr: Commandes SPI

source: `spi_transfer oid=%c data=%*s` : This command causes the micro-controller to send 'data' to the spi device specified by 'oid' and it generates a "spi_transfer_response" response message with the data returned during the transmission.
fr: `spi_transfer oid=%c data=%*s` : Cette commande amène le microcontrôleur à envoyer des "données" au périphérique spi spécifié par "oid" et génère un message de réponse "spi_transfer_response" avec les données retournées par le périphérique.

source: `spi_send oid=%c data=%*s` : This command is similar to "spi_transfer", but it does not generate a "spi_transfer_response" message.
fr: `spi_send oid=%c data=%*s` : Cette commande est similaire à "spi_transfer", mais elle ne génère pas de message "spi_transfer_response".

source: MCU commands
fr: Commandes MCU

source: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u` : This command creates an internal stepper object. The 'step_pin' and 'dir_pin' parameters specify the step and direction pins respectively; this command will configure them in digital output mode. The 'invert_step' parameter specifies whether a step occurs on a rising edge (invert_step=0) or falling edge (invert_step=1). The 'step_pulse_ticks' parameter specifies the minimum duration of the step pulse. If the mcu exports the constant 'STEPPER_BOTH_EDGE=1' then setting step_pulse_ticks=0 and invert_step=-1 will setup for stepping on both the rising and falling edges of the step pin.
fr: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u` : Cette commande crée un objet "moteur pas à pas" interne. Les paramètres 'step_pin' et 'dir_pin' spécifient respectivement les broches de pas et de direction ; cette commande les configurera en mode de sortie numérique. Le paramètre 'invert_step' spécifie si une étape se produit sur un front montant (invert_step=0) ou descendant (invert_step=1). Le paramètre 'step_pulse_ticks' spécifie la durée minimale de l'impulsion de pas. Si le mcu exporte la constante 'STEPPER_BOTH_EDGE=1', le réglage step_pulse_ticks=0 et invert_step=-1 sera configuré pour marcher sur les fronts montant et descendant de la broche de pas.
