Repository: z1996xm/BIGTREETECH_translations
Catalog: locales/*/LC_MESSAGES/MCU_Commands.po
Languages: fr

source: This document provides information on the low-level micro-controller commands that are sent from the Klipper "host" software and processed by the Klipper micro-controller software. This document is not an authoritative reference for these commands, nor is it an exclusive list of all available commands.
fr: Ce document fournit des informations sur les commandes de bas niveau du microcontrôleur qui sont envoyées depuis le logiciel "hôte" Klipper et traitées par le firmware Klipper du microcontrôleur. Ce document n'est pas une référence faisant autorité pour ces commandes, ni une liste exclusive de toutes les commandes disponibles.

source: This document may be useful for developers interested in understanding the low-level micro-controller commands.
fr: Ce document peut être utile aux développeurs souhaitant comprendre les commandes de bas niveau du microcontrôleur.

source: See the [protocol](Protocol.md) document for more information on the format of commands and their transmission. The commands here are described using their "printf" style syntax - for those unfamiliar with that format, just note that where a '%...' sequence is seen it should be replaced with an actual integer. For example, a description with "count=%c" could be replaced with the text "count=10". Note that parameters that are considered "enumerations" (see the above protocol document) take a string value which is automatically converted to an integer value for the micro-controller. This is common with parameters named "pin" (or that have a suffix of "_pin").
fr: Voir le document [protocole](Protocol.md) pour plus d'informations sur le format des commandes et leur transmission. Les commandes ici sont décrites en utilisant une syntaxe de style "printf" - pour ceux qui ne connaissent pas ce format, notez simplement que lorsqu'une séquence '%...' est vue, elle doit être remplacée par un entier réel. Par exemple, une description avec "count=%c" pourrait être remplacée par le texte "count=10". Notez que les paramètres qui sont considérés comme des "énumérations" (voir le document de protocole ci-dessus) prennent une valeur de chaîne qui est automatiquement convertie en une valeur entière pour le microcontrôleur. Ceci est courant avec les paramètres nommés "pin" (ou qui ont le suffixe "_pin").

source: Startup Commands
fr: Commandes de démarrage

source: It may be necessary to take certain one-time actions to configure the micro-controller and its peripherals. This section lists common commands available for that purpose. Unlike most micro-controller commands, these commands run as soon as they are received and they do not require any particular setup.
fr: Il peut être nécessaire d'effectuer des actions ponctuelles pour configurer le microcontrôleur et ses périphériques. Cette section répertorie les commandes courantes disponibles à cette effet. Contrairement à la plupart des commandes de microcontrôleur, ces commandes s'exécutent dès leur réception et ne nécessitent aucune configuration particulière.

source: Common startup commands:
fr: Commandes de démarrage courantes :

source: `set_digital_out pin=%u value=%c` : This command immediately configures the given pin as a digital out GPIO and it sets it to either a low level (value=0) or a high level (value=1). This command may be useful for configuring the initial value of LEDs and for configuring the initial value of stepper driver micro-stepping pins.
fr: `set_digital_out pin=%u value=%c` : Cette commande configure immédiatement la broche donnée en tant que sortie numérique GPIO et la définit soit à un niveau bas (valeur=0) soit à un niveau haut (valeur=1 ). Cette commande peut être utile pour configurer la valeur initiale des LED et pour configurer la valeur initiale des broches de micro-pas du pilote de moteur pas à pas.

source: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : This command will immediately configure the given pin to use hardware based pulse-width-modulation (PWM) with the given number of cycle_ticks. The "cycle_ticks" is the number of MCU clock ticks each power on and power off cycle should last. A cycle_ticks value of 1 can be used to request the fastest possible cycle time. The "value" parameter is between 0 and 255 with 0 indicating a full off state and 255 indicating a full on state. This command may be useful for enabling CPU and nozzle cooling fans.
fr: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : Cette commande configurera la broche donnée pour utiliser la modulation de largeur d'impulsion (PWM) basée sur le matériel avec le nombre donné de cycle_ticks. Le "cycle_ticks" est le nombre de ticks d'horloge du MCU que chaque cycle de mise sous tension et hors tension doit durer. Une valeur cycle_ticks de 1 peut être utilisée pour demander le temps de cycle le plus rapide possible. Le paramètre "valeur" est compris entre 0 et 255, 0 indiquant un état entièrement désactivé et 255 indiquant un état entièrement activé. Cette commande peut être utile pour activer les ventilateurs de refroidissement du processeur et des buses.

source: Low-level micro-controller configuration
fr: Configuration bas niveau du microcontrôleur

source: Most commands in the micro-controller require an initial setup before they can be successfully invoked. This section provides an overview of the configuration process. This section and the following sections are likely only of interest to developers interested in the internal details of Klipper.
fr: La plupart des commandes du microcontrôleur nécessitent une configuration initiale avant de pouvoir être appelées. Cette section fournit une vue d'ensemble du processus de configuration. Cette section et les sections suivantes ne sont susceptibles d'intéresser que les développeurs intéressés par les détails internes de Klipper.

source: When the host first connects to the micro-controller it always starts by obtaining a data dictionary (see [protocol](Protocol.md) for more information). After the data dictionary is obtained the host will check if the micro-controller is in a "configured" state and configure it if not. Configuration involves the following phases:
fr: Lorsque l'hôte se connecte pour la première fois au microcontrôleur, il commence toujours par obtenir un dictionnaire de données (voir [protocole](Protocol.md) pour plus d'informations). Une fois le dictionnaire de données obtenu, l'hôte vérifie si le microcontrôleur est dans un état "configuré" et le configure si ce n'est pas le cas. La configuration comprend les phases suivantes :

source: `get_config` : The host starts by checking if the micro-controller is already configured. The micro-controller responds to this command with a "config" response message. The micro-controller software always starts in an unconfigured state at power-on. It remains in this state until the host completes the configuration processes (by issuing a finalize_config command). If the micro-controller is already configured from a previous session (and is configured with the desired settings) then no further action is needed by the host and the configuration process ends successfully.
fr: `get_config` : L'hôte commence par vérifier si le micro-contrôleur est déjà configuré. Le microcontrôleur répond à cette commande par un message de réponse « config ». Le logiciel du microcontrôleur démarre toujours dans un état non configuré à la mise sous tension. Il reste dans cet état jusqu'à ce que l'hôte termine les processus de configuration (en émettant une commande finalize_config). Si le microcontrôleur est déjà configuré à partir d'une session précédente (et est configuré avec les paramètres souhaités), aucune autre action n'est requise de la part de l'hôte et le processus de configuration se termine avec succès.

source: `allocate_oids count=%c` : This command is issued to inform the micro-controller of the maximum number of object-ids (oid) that the host requires. It is only valid to issue this command once. An oid is an integer identifier allocated to each stepper, each endstop, and each schedulable gpio pin. The host determines in advance the number of oids it will require to operate the hardware and passes this to the micro-controller so that it may allocate sufficient memory to store a mapping from oid to internal object.
fr: `allocate_oids count=%c` : cette commande est envoyée pour informer le microcontrôleur du nombre maximal d'identifiants d'objet (oid) requis par l'hôte. Il n'e faut envoyer cette commande qu'une seule fois. Un oid est un identifiant entier alloué à chaque stepper, chaque fin de course et chaque broche gpio programmable. L'hôte détermine à l'avance le nombre d'oids dont il aura besoin pour faire fonctionner le matériel et le transmet au microcontrôleur afin qu'il puisse allouer suffisamment de mémoire pour stocker un mappage de l'oid à l'objet interne.

source: `config_XXX oid=%c ...` : By convention any command starting with the "config_" prefix creates a new micro-controller object and assigns the given oid to it. For example, the config_digital_out command will configure the specified pin as a digital output GPIO and create an internal object that the host can use to schedule changes to the given GPIO. The oid parameter passed into the config command is selected by the host and must be between zero and the maximum count supplied in the allocate_oids command. The config commands may only be run when the micro-controller is not in a configured state (ie, prior to the host sending finalize_config) and after the allocate_oids command has been sent.
fr: `config_XXX oid=%c ...` : Par convention toute commande commençant par le préfixe "config_" crée un nouvel objet microcontrôleur et lui affecte l'oid donné. Par exemple, la commande config_digital_out configurera la broche spécifiée en tant que GPIO de sortie numérique et créera un objet interne que l'hôte peut utiliser pour planifier des modifications du GPIO donné. Le paramètre oid passé dans la commande config est sélectionné par l'hôte et doit être compris entre zéro et le nombre maximal fourni dans la commande allow_oids. Les commandes de configuration ne peuvent être exécutées que lorsque le microcontrôleur n'est pas dans un état configuré (c'est-à-dire avant que l'hôte n'envoie finalize_config) et après que la commande allow_oids a été envoyée.

source: `finalize_config crc=%u` : The finalize_config command transitions the micro-controller from an unconfigured state to a configured state. The crc parameter passed to the micro-controller is stored and provided back to the host in "config" response messages. By convention, the host takes a 32bit CRC of the configuration it will request and at the start of subsequent communication sessions it checks that the CRC stored in the micro-controller exactly matches its desired CRC. If the CRC does not match then the host knows the micro-controller has not been configured in the state desired by the host.
fr: `finalize_config crc=%u` : La commande finalize_config fait passer le microcontrôleur d'un état non configuré à un état configuré. Le paramètre crc transmis au microcontrôleur est stocké et renvoyé à l'hôte dans les messages de réponse "config". Par convention, l'hôte prend un CRC 32 bits de la configuration qu'il demandera et au début des sessions de communication suivantes, il vérifie que le CRC stocké dans le microcontrôleur correspond exactement à son CRC souhaité. Si le CRC ne correspond pas, l'hôte saura que le microcontrôleur n'a pas été configuré correctement.

source: Common micro-controller objects
fr: Objets de base du microcontrôleur

source: This section lists some commonly used config commands.
fr: Cette section répertorie quelques commandes de configuration couramment utilisées.

source: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : This command creates an internal micro-controller object for the given GPIO 'pin'. The pin will be configured in digital output mode and set to an initial value as specified by 'value' (0 for low, 1 for high). Creating a digital_out object allows the host to schedule GPIO updates for the given pin at specified times (see the queue_digital_out command described below). Should the micro-controller software go into shutdown mode then all configured digital_out objects will be set to 'default_value'. The 'max_duration' parameter is used to implement a safety check - if it is non-zero then it is the maximum number of clock ticks that the host may set the given GPIO to a non-default value without further updates. For example, if the default_value is zero and the max_duration is 16000 then if the host sets the gpio to a value of one then it must schedule another update to the gpio pin (to either zero or one) within 16000 clock ticks. This safety feature can be used with heater pins to ensure the host does not enable the heater and then go off-line.
fr: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : cette commande crée un objet de microcontrôleur interne pour la "broche" GPIO donnée. La broche sera configurée en mode de sortie numérique et définie sur une valeur initiale telle que spécifiée par 'value' (0 pour bas, 1 pour haut). La création d'un objet digital_out permet à l'hôte de programmer des mises à jour GPIO pour la broche donnée à des heures spécifiées (voir la commande queue_digital_out décrite ci-dessous). Si le logiciel du microcontrôleur passe en mode d'arrêt, tous les objets digital_out configurés seront définis sur 'default_value'. Le paramètre 'max_duration' est utilisé pour implémenter un contrôle de sécurité - s'il est différent de zéro, il s'agit du nombre maximal de ticks d'horloge pendannt lesquels l'hôte peut définir le GPIO donné sur une valeur autre que celle par défaut sans autres mises à jour. Par exemple, si la default_value est zéro et la max_duration est de 16000, alors si l'hôte définit le gpio sur une valeur de un, il doit planifier une autre mise à jour de la broche gpio (à zéro ou à un) dans les 16000 tics d'horloge. Cette fonction de sécurité peut être utilisée avec des broches de chauffage pour s'assurer que l'hôte n'active pas le chauffage puis se déconnecte en le laissant activé.

source: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : This command creates an internal object for hardware based PWM pins that the host may schedule updates for. Its usage is analogous to config_digital_out - see the description of the 'set_pwm_out' and 'config_digital_out' commands for parameter description.
fr: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : cette commande crée un objet interne pour les broches PWM matérielles pour lesquelles l'hôte peut planifier des mises à jour . Son utilisation est analogue à config_digital_out - voir la description des commandes 'set_pwm_out' et 'config_digital_out' pour la description des paramètres.

source: `config_analog_in oid=%c pin=%u` : This command is used to configure a pin in analog input sampling mode. Once configured, the pin can be sampled at regular interval using the query_analog_in command (see below).
fr: `config_analog_in oid=%c pin=%u` : Cette commande permet de configurer une broche en mode d'échantillonnage d'entrée analogique. Une fois configurée, la broche peut être échantillonnée à intervalle régulier à l'aide de la commande query_analog_in (voir ci-dessous).

source: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : This command creates an internal "endstop" object. It is used to specify the endstop pins and to enable "homing" operations (see the endstop_home command below). The command will configure the specified pin in digital input mode. The 'pull_up' parameter determines whether hardware provided pullup resistors for the pin (if available) will be enabled. The 'stepper_count' parameter specifies the maximum number of steppers that this endstop may need to halt during a homing operation (see endstop_home below).
fr: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : Cette commande crée un objet "endstop" interne. Il est utilisé pour spécifier les broches d'arrêt et pour activer les opérations de "homing" (voir la commande endstop_home ci-dessous). La commande configurera la broche spécifiée en mode d'entrée numérique. Le paramètre 'pull_up' détermine si les résistances pullup fournies par le matériel pour la broche (si disponibles) seront activées. Le paramètre 'stepper_count' spécifie le nombre maximum de pas dont cette butée peut avoir besoin pendant une opération de prise d'origine (voir endstop_home ci-dessous).

source: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : This command creates an internal SPI object. It is used with spi_transfer and spi_send commands (see below). The "bus" identifies the SPI bus to use (if the micro-controller has more than one SPI bus available). The "pin" specifies the chip select (CS) pin for the device. The "mode" is the SPI mode (should be between 0 and 3). The "rate" parameter specifies the SPI bus rate (in cycles per second). Finally, the "shutdown_msg" is an SPI command to send to the given device should the micro-controller go into a shutdown state.
fr: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : Cette commande crée un objet SPI interne. Il est utilisé avec les commandes spi_transfer et spi_send (voir ci-dessous). Le paramètre "bus" identifie le bus SPI à utiliser (si le microcontrôleur a plus d'un bus SPI disponible). Le paramètre "broche" spécifie la broche de sélection de puce (CS) pour le périphérique. Le paramètre "mode" est le mode SPI (doit être compris entre 0 et 3). Le paramètre "rate" spécifie le débit du bus SPI (en cycles par seconde). Enfin, le paramètre "shutdown_msg" est une commande SPI à envoyer à l'appareil donné si le microcontrôleur passe en état d'arrêt.

source: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : This command is similar to config_spi, but without a CS pin definition. It is useful for SPI devices that do not have a chip select line.
fr: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : Cette commande est similaire à config_spi, mais sans définition de la broche CS. Il est utile pour les appareils SPI qui n'ont pas de ligne de sélection de puce.

source: Common commands
fr: Commandes courantes

source: This section lists some commonly used run-time commands. It is likely only of interest to developers looking to gain insight into Klipper.
fr: Cette section répertorie les commandes les plus couramment utilisées. Cela n'intéresse probablement que les développeurs qui cherchent à mieux comprendre Klipper.

source: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : This command configures a digital output pin (as created by config_digital_out) to use "software PWM". The 'cycle_ticks' is the number of clock ticks for the PWM cycle. Because the output switching is implemented in the micro-controller software, it is recommended that 'cycle_ticks' correspond to a time of 10ms or greater.
fr: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : cette commande configure une broche de sortie numérique (telle que créée par config_digital_out) pour utiliser le "PWM logciel". Le 'cycle_ticks' est le nombre de tics d'horloge pour le cycle PWM. Étant donné que la commutation de sortie est implémentée dans le logiciel du microcontrôleur, il est recommandé que 'cycle_ticks' corresponde à un temps de 10 ms ou plus.

source: `queue_digital_out oid=%c clock=%u on_ticks=%u` : This command will schedule a change to a digital output GPIO pin at the given clock time. To use this command a 'config_digital_out' command with the same 'oid' parameter must have been issued during micro-controller configuration. If 'set_digital_out_pwm_cycle' has been called then 'on_ticks' is the on duration (in clock ticks) for the pwm cycle. Otherwise, 'on_ticks' should be either 0 (for low voltage) or 1 (for high voltage).
fr: `queue_digital_out oid=%c clock=%u on_ticks=%u` : Cette commande permet de planifier une changement d'état d'une broche GPIO de sortie numérique au tick d'horloge donnée. Pour utiliser cette commande, une commande 'config_digital_out' avec le même paramètre 'oid' doit avoir été émise lors de la configuration du microcontrôleur. Si 'set_digital_out_pwm_cycle' a été appelé, alors 'on_ticks' est la durée d'activation (en ticks d'horloge) pour le cycle pwm. Sinon, 'on_ticks' doit être soit 0 (pour basse tension) soit 1 (pour haute tension).

source: `queue_pwm_out oid=%c clock=%u value=%hu` : Schedules a change to a hardware PWM output pin. See the 'queue_digital_out' and 'config_pwm_out' commands for more info.
fr: `queue_pwm_out oid=%c clock=%u value=%hu` : planifie un changement sur une broche de sortie PWM matérielle. Voir les commandes 'queue_digital_out' et 'config_pwm_out' pour plus d'informations.

source: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : This command sets up a recurring schedule of analog input samples. To use this command a 'config_analog_in' command with the same 'oid' parameter must have been issued during micro-controller configuration. The samples will start as of 'clock' time, it will report on the obtained value every 'rest_ticks' clock ticks, it will over-sample 'sample_count' number of times, and it will pause 'sample_ticks' number of clock ticks between over-sample samples. The 'min_value' and 'max_value' parameters implement a safety feature - the micro-controller software will verify the sampled value (after any oversampling) is always between the supplied range. This is intended for use with pins attached to thermistors controlling heaters - it can be used to check that a heater is within a temperature range.
fr: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : Cette commande définit une récupération récurrente d'échantillons d'entrée analogique. Pour utiliser cette commande, une commande 'config_analog_in' avec le même paramètre 'oid' doit avoir été émise lors de la configuration du microcontrôleur. Les échantillons commenceront à partir de l'heure 'clock', et ils rapporteront la valeur obtenue à chaque tic d'horloge 'rest_ticks', il suréchantillonnera avec un nombre 'sample_count' d'échantillons et il se mettra en pause pendant le nombre 'sample_ticks' de tic d'horloge entre chaque échantillonnage. Les paramètres 'min_value' et 'max_value' implémentent une fonction de sécurité - le logiciel du microcontrôleur vérifiera que la valeur échantillonnée se situe toujours dans la plage fournie. Ceci est destiné à être utilisé avec des broches rattachées aux thermistances contrôlant les radiateurs - il peut être utilisé pour vérifier qu'un radiateur se trouve dans une plage de température correcte.

source: `get_clock` : This command causes the micro-controller to generate a "clock" response message. The host sends this command once a second to obtain the value of the micro-controller clock and to estimate the drift between host and micro-controller clocks. It enables the host to accurately estimate the micro-controller clock.
fr: `get_clock` : Cette commande amène le microcontrôleur à générer un message de réponse "clock". L'hôte envoie cette commande une fois par seconde pour obtenir la valeur de l'horloge du microcontrôleur et pour estimer la dérive entre les horloges de l'hôte et du microcontrôleur. Il permet à l'hôte d'estimer avec précision l'horloge du microcontrôleur.

source: Stepper commands
fr: Commandes de moteurs pas à pas
