Repository: z1996xm/BIGTREETECH_translations
Catalog: locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: fr

source: Resonance Compensation
fr: Compensation de résonance

source: Klipper supports Input Shaping - a technique that can be used to reduce ringing (also known as echoing, ghosting or rippling) in prints. Ringing is a surface printing defect when, typically, elements like edges repeat themselves on a printed surface as a subtle 'echo':
fr: Klipper prend en charge la mise en forme de l'entrée, une technique utilisée pour réduire l'effet de résonance (également connu sous le nom d'écho, d'image fantôme ou d'ondulation) dans les impressions. La résonance est un défaut d'impression de surface lorsque des éléments tels que des bords se répètent sur une surface imprimée sous forme d'un "écho" subtil :

source: |![Ringing test](img/ringing-test.jpg)|![3D Benchy](img/ringing-3dbenchy.jpg)|
fr: |![Test de résonance](img/ringing-test.jpg)|![3D Benchy](img/ringing-3dbenchy.jpg)|

source: Ringing is caused by mechanical vibrations in the printer due to quick changes of the printing direction. Note that ringing usually has mechanical origins: insufficiently rigid printer frame, non-tight or too springy belts, alignment issues of mechanical parts, heavy moving mass, etc. Those should be checked and fixed first, if possible.
fr: La résonance est causée par des vibrations mécaniques dans l'imprimante dues à des changements rapides de direction durant une impression. Notez que la résonance a généralement des origines mécaniques : cadre de l'imprimante insuffisamment rigide, courroies non tendues ou trop élastiques, problèmes d'alignement des pièces mécaniques, masse mobile importante, etc. Ces problèmes doivent être vérifiés et corrigés en premier lieu, si possible.

source: [Input shaping](https://en.wikipedia.org/wiki/Input_shaping) is an open-loop control technique which creates a commanding signal that cancels its own vibrations. Input shaping requires some tuning and measurements before it can be enabled. Besides ringing, Input Shaping typically reduces the vibrations and shaking of the printer in general, and may also improve the reliability of the stealthChop mode of Trinamic stepper drivers.
fr: La [mise en forme de l'entrée](https://en.wikipedia.org/wiki/Input_shaping) est une technique de contrôle en boucle ouverte qui crée un signal de commande annulant ses propres vibrations. La mise en forme de l'entrée nécessite quelques réglages et mesures avant de pouvoir être activée. Outre la résonance, la mise en forme de l'entrée réduit généralement les vibrations et les secousses de l'imprimante en général, et peut également améliorer la fiabilité du mode stealthChop des pilotes Trinamic.

source: Tuning
fr: Réglages

source: Slice the ringing test model, which can be found in [docs/prints/ringing_tower.stl](prints/ringing_tower.stl), in the slicer:
fr: Tranchez le modèle de test de résonance, qui se trouve dans [docs/prints/ringing_tower.stl](prints/ringing_tower.stl), dans le trancheur :

source: Suggested layer height is 0.2 or 0.25 mm.
fr: La hauteur de couche suggérée est de 0,2 ou 0,25 mm.

source: Infill and top layers can be set to 0.
fr: Les couches de remplissage et de finition peuvent être réglées sur 0.

source: Use 1-2 perimeters, or even better the smooth vase mode with 1-2 mm base.
fr: Utilisez 1-2 périmètres, ou mieux encore le mode vase avec 1-2 mm de base.

source: Use sufficiently high speed, around 80-100 mm/sec, for **external** perimeters.
fr: Utilisez une vitesse suffisamment élevée, environ 80-100 mm/s, pour les périmètres **externes**.

source: Make sure that the minimum layer time is **at most** 3 seconds.
fr: Veillez à ce que le temps de pause minimum soit **au maximum** de 3 secondes.

source: Make sure any "dynamic acceleration control" is disabled in the slicer.
fr: Assurez-vous que le "contrôle d'accélération" est désactivé dans le trancheur.

source: Do not turn the model. The model has X and Y marks at the back of the model. Note the unusual location of the marks vs. the axes of the printer - it is not a mistake. The marks can be used later in the tuning process as a reference, because they show which axis the measurements correspond to.
fr: Ne tournez pas le modèle. Le modèle comporte des marques X et Y à l'arrière du modèle. Notez l'emplacement inhabituel des marques par rapport aux axes de l'imprimante - il ne s'agit pas d'une erreur. Les marques peuvent être utilisées plus tard dans le processus de réglage comme référence, car elles indiquent à quel axe correspondent les mesures.

source: Ringing frequency
fr: Fréquence de résonance

source: First, measure the **ringing frequency**.
fr: Tout d'abord, mesurez la **fréquence de résonance**.

source: If you have already added `[input_shaper]` section to the printer.cfg, execute `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0` command. If you get "Unknown command" error, you can safely ignore it at this point and continue with the measurements.
fr: Si vous avez déjà ajouté la section `[input_shaper]` au printer.cfg, exécutez la commande `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0`. Si vous obtenez l'erreur "Unknown command", vous pouvez l'ignorer à ce stade et continuer les mesures.

source: Print the test model sliced with the suggested parameters.
fr: Imprimez le modèle de test tranché avec les paramètres suggérés.

source: You can stop the print earlier if the ringing is clearly visible and you see that acceleration gets too high for your printer (e.g. printer shakes too much or starts skipping steps).
fr: Vous pouvez arrêter l'impression plus tôt si la résonance est clairement visible et si vous constatez que l'accélération devient trop forte pour votre imprimante (par exemple, l'imprimante tremble trop ou commence à sauter des pas).

source: Use X and Y marks at the back of the model for reference. The measurements from the side with X mark should be used for X axis *configuration*, and Y mark - for Y axis configuration. Measure the distance *D* (in mm) between several oscillations on the part with X mark, near the notches, preferably skipping the first oscillation or two. To measure the distance between oscillations more easily, mark the oscillations first, then measure the distance between the marks with a ruler or calipers:
fr: Utilisez les marques X et Y à l'arrière du modèle comme référence. Les mesures du côté avec la marque X doivent être utilisées pour la *configuration* de l'axe X, et la marque Y - pour la configuration de l'axe Y. Mesurez la distance *D* (en mm) entre plusieurs oscillations sur la pièce avec la marque X, près des encoches, en sautant de préférence la ou les deux premières oscillations. Pour mesurer plus facilement la distance entre les oscillations, marquez d'abord les oscillations, puis mesurez la distance entre les marques avec une règle ou un pied à coulisse :

source: |![Mark ringing](img/ringing-mark.jpg)|![Measure ringing](img/ringing-measure.jpg)|
fr: |![Marques de résonances](img/ringing-mark.jpg)|![Mesure de la résonance](img/ringing-measure.jpg)|

source: Count how many oscillations *N* the measured distance *D* corresponds to. If you are unsure how to count the oscillations, refer to the picture above, which shows *N* = 6 oscillations.
fr: Comptez le nombre d'oscillations *N* correspondant à la distance mesurée *D*. Si vous ne savez pas comment compter les oscillations, reportez-vous à l'image ci-dessus, qui montre *N* = 6 oscillations.

source: Compute the ringing frequency of X axis as *V* &middot; *N* / *D* (Hz), where *V* is the velocity for outer perimeters (mm/sec). For the example above, we marked 6 oscillations, and the test was printed at 100 mm/sec velocity, so the frequency is 100 * 6 / 12.14 ≈ 49.4 Hz.
fr: Calculer la fréquence de résonance de l'axe X comme *V* &middot; *N* / *D* (Hz), où *V* est la vitesse des périmètres extérieurs (mm/s). Pour l'exemple ci-dessus, nous avons marqué 6 oscillations, et le test a été imprimé à une vitesse de 100 mm/s, donc la fréquence est 100 * 6 / 12,14 ≈ 49,4 Hz.

source: Note that ringing on the test print should follow the pattern of the curved notches, as in the picture above. If it doesn't, then this defect is not really a ringing and has a different origin - either mechanical, or an extruder issue. It should be fixed first before enabling and tuning input shapers.
fr: Notez que la résonanc sur l'impression de test devrait correspondre au modèle des encoches courbes, comme dans l'image ci-dessus. Si ce n'est pas le cas, alors ce défaut n'est pas vraiment une résonance et a probablement une origine différente - soit mécanique, soit un problème d'extrudeuse. Ce problème doit être résolu avant d'activer et de régler les façonneurs d'entrée.

source: If the measurements are not reliable because, say, the distance between the oscillations is not stable, it might mean that the printer has several resonance frequencies on the same axis. One may try to follow the tuning process described in [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) section instead and still get something out of the input shaping technique.
fr: Si les mesures ne sont pas fiables parce que, par exemple, la distance entre les oscillations n'est pas stable, cela peut signifier que l'imprimante a plusieurs fréquences de résonance sur le même axe. On peut essayer de suivre le processus de réglage décrit dans la section [Mesures peu fiables des fréquences de résonance](#unreliable-measurements-of-ringing-frequencies) à la place et obtenir quand même quelque chose de la technique de mise en forme de l'entrée.

source: Ringing frequency can depend on the position of the model within the buildplate and Z height, *especially on delta printers*; you can check if you see the differences in frequencies at different positions along the sides of the test model and at different heights. You can calculate the average ringing frequencies over X and Y axes if that is the case.
fr: La fréquence de résonance peut dépendre de la position du modèle sur la plaque de construction et de la hauteur Z, *surtout sur les imprimantes delta* ; vous pouvez vérifier si vous observez des différences de fréquences à différentes positions le long des côtés du modèle de test et à différentes hauteurs. Vous pouvez calculer les fréquences de résonance moyennes sur les axes X et Y si c'est le cas.

source: If the measured ringing frequency is very low (below approx 20-25 Hz), it might be a good idea to invest into stiffening the printer or decreasing the moving mass - depending on what is applicable in your case - before proceeding with further input shaping tuning, and re-measuring the frequencies afterwards. For many popular printer models there are often some solutions available already.
fr: Si la fréquence de résonance mesurée est très basse (inférieure à 20-25 Hz environ), il peut être judicieux d'investir dans le raidissement de l'imprimante ou la réduction de la masse mobile - selon ce qui est applicable dans votre cas - avant de poursuivre le réglage de la mise en forme de l'entrée et de mesurer à nouveau les fréquences par la suite. Pour de nombreux modèles d'imprimantes populaires, il existe souvent des solutions déjà disponibles.

source: Note that the ringing frequencies can change if the changes are made to the printer that affect the moving mass or change the stiffness of the system, for example:
fr: Les fréquences de résonance peuvent changer si des modifications sont apportées à l'imprimante qui affectent la masse en mouvement ou modifient la rigidité du système, par exemple :

source: Some tools are installed, removed or replaced on the toolhead that change its mass, e.g. a new (heavier or lighter) stepper motor for direct extruder or a new hotend is installed, heavy fan with a duct is added, etc.
fr: Si la tête d'impression est modifiée, par ex. changement de moteur pas à pas (plus lourd ou plus léger) pour une extrusion directe, remplacement de la tête de l'outil (plus ou moins lourde), ajout d'un ventilateur plus lourd, etc.

source: Belts are tightened.
fr: La tension des courroies a été modifiée.

source: Some addons to increase frame rigidity are installed.
fr: Des pièces conçues pour augmenter la rigidité du cadre sont installées.

source: Different bed is installed on a bed-slinger printer, or glass added, etc.
fr: Un plateau différent est installé sur une imprimante à lit mobile, ou une plaque de verre est ajoutée, etc.

source: If such changes are made, it is a good idea to at least measure the ringing frequencies to see if they have changed.
fr: Si de tels changements sont apportés, Il est conseillé de mesurer au moins les fréquences de résonance pour vérifier s'il y a eu un changement ou pas.

source: Input shaper configuration
fr: Configuration de l'"input shaper"

source: After the ringing frequencies for X and Y axes are measured, you can add the following section to your `printer.cfg`:
fr: Une fois les fréquences de résonance des axes X et Y mesurées, vous pouvez ajouter la section suivante à votre `printer.cfg` :

source: For the example above, we get shaper_freq_x/y = 49.4.
fr: Pour l'exemple ci-dessus, nous obtenons shaper_freq_x/y = 49,4.

source: Choosing input shaper
fr: Choix de l'"input shaper"

source: Klipper supports several input shapers. They differ in their sensitivity to errors determining the resonance frequency and how much smoothing they cause in the printed parts. Also, some of the shapers like 2HUMP_EI and 3HUMP_EI should usually not be used with shaper_freq = resonance frequency - they are configured from different considerations to reduce several resonances at once.
fr: Klipper prend en charge plusieurs type d'"input shaper". Ils diffèrent par leur sensibilité aux erreurs déterminant la fréquence de résonance et le degré de lissage qu'ils provoquent dans les pièces imprimées. De plus, certains de ces "input shaper" comme 2HUMP_EI et 3HUMP_EI ne doivent généralement pas être utilisés avec shaper_freq = fréquence de résonance - ils sont configurés à partir de différentes considérations pour réduire plusieurs résonances à la fois (ndt : le 2HUMP_EI est à utiliser lorsque deux pics de résonance sont détectés, le 3HUMP_EI est à utiliser lorsque trois pics de résonance sont détectés).

source: For most of the printers, either MZV or EI shapers can be recommended. This section describes a testing process to choose between them, and figure out a few other related parameters.
fr: Pour la plupart des imprimantes, les shapers MZV ou EI peuvent être recommandés. Cette section décrit un processus de test pour choisir entre eux et déterminer quelques autres paramètres connexes.

source: If you see no ringing at this point, then MZV shaper can be recommended for use.
fr: Si vous ne voyez pas de résonance à ce stade, l'utilisation de l'"input shaper" MZV peut être recommandée.

source: If you do see some ringing, re-measure the frequencies using steps (8)-(10) described in [Ringing frequency](#ringing-frequency) section. If the frequencies differ significantly from the values you obtained earlier, a more complex input shaper configuration is needed. You can refer to Technical details of [Input shapers](#input-shapers) section. Otherwise, proceed to the next step.
fr: Si vous voyez une résonance, mesurez à nouveau les fréquences en suivant les étapes (8) à (10) décrites dans la section [Fréquence de résonance](#ringing-frequency). Si les fréquences diffèrent considérablement des valeurs obtenues précédemment, une configuration d'input shaper plus complexe est nécessaire. Vous pouvez vous référer aux détails techniques de la section [Input shapers](#input-shapers). Sinon, passez à l'étape suivante.

source: Compare two prints with MZV and EI input shaper. If EI shows noticeably better results than MZV, use EI shaper, otherwise prefer MZV. Note that EI shaper will cause more smoothing in printed parts (see the next section for further details). Add `shaper_type: mzv` (or ei) parameter to [input_shaper] section, e.g.:
fr: Comparez deux impressions avec les input shaper MZV et EI. Si EI montre des résultats sensiblement meilleurs que MZV, utilisez EI, sinon préférez MZV. Notez que le input shaper EI provoquera plus de lissage dans les pièces imprimées (voir la section suivante pour plus de détails). Ajoutez le paramètre `shaper_type: mzv` (ou ei) à la section [input_shaper], par exemple :

source: A few notes on shaper selection:
fr: Quelques notes sur le choix de l'input shaper :

source: EI shaper may be more suited for bed slinger printers (if the resonance frequency and resulting smoothing allows): as more filament is deposited on the moving bed, the mass of the bed increases and the resonance frequency will decrease. Since EI shaper is more robust to resonance frequency changes, it may work better when printing large parts.
fr: L' input shaper EI peut être plus adapté aux imprimantes à lit mobile (si la fréquence de résonance et le lissage résultant le permettent) : plus le filament est déposé sur le lit en mouvement, plus la masse du lit augmente et la fréquence de résonance diminue. Étant donné que le input shaper EI est plus robuste aux changements de fréquence de résonance, il peut mieux fonctionner lors de l'impression de grandes pièces.

source: Due to the nature of delta kinematics, resonance frequencies can differ a lot in different parts of the build volume. Therefore, EI shaper can be a better fit for delta printers rather than MZV or ZV, and should be considered for the use. If the resonance frequency is sufficiently large (more than 50-60 Hz), then one can even attempt to test 2HUMP_EI shaper (by running the suggested test above with `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), but check the considerations in the [section below](#selecting-max_accel) before enabling it.
fr: En raison de la nature de la cinématique delta, les fréquences de résonance peuvent différer considérablement dans différentes parties du volume de construction. Par conséquent, l'input shaper EI peut être mieux adapté aux imprimantes delta plutôt que MZV ou ZV. Si la fréquence de résonance est suffisamment grande (plus de 50-60 Hz), alors on peut même essayer de tester 2HUMP_EI (en exécutant le test suggéré ci-dessus avec `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), mais vérifiez les considérations dans la [section ci-dessous](#selecting-max_accel) avant de l'activer.

source: Selecting max_accel
fr: Sélection de max_accel

source: In order to select a suitable max_accel value, inspect the model for the chosen input shaper. First, take a note at which acceleration ringing is still small - that you are comfortable with it.
fr: Afin de sélectionner une valeur max_accel appropriée, inspectez le modèle pour l'input shaper choisi. Tout d'abord, notez à quelle accélération la résonance est encore faible - convenant également à l'imprimante.

source: Next, check the smoothing. To help with that, the test model has a small gap in the wall (0.15 mm):
fr: Ensuite, vérifiez le lissage. Pour vous aider, le modèle de test a un petit espace dans la paroi (0,15 mm) :

source: ![Test gap](img/smoothing-test.png)
fr: ![Ecart de test](img/smoothing-test.png)

source: As the acceleration increases, so does the smoothing, and the actual gap in the print widens:
fr: À mesure que l'accélération augmente, le lissage augmente également et l'espacement réel dans l'impression s'élargit :

source: ![Shaper smoothing](img/shaper-smoothing.jpg)
fr: ![Lissage de l'input shaper](img/shaper-smoothing.jpg)

source: In this picture, the acceleration increases left to right, and the gap starts to grow starting from 3500 mm/sec^2 (5-th band from the left). So the good value for max_accel = 3000 (mm/sec^2) in this case to avoid the excessive smoothing.
fr: Sur cette image, l'accélération augmente de gauche à droite, et l'écart commence à croître à partir de 3500 mm/s² (5ème bande à partir de la gauche). Dans ce cas, la valeur pour max_accel = 3000 (mm/s²) permet d'éviter un lissage excessif.

source: Note the acceleration when the gap is still very small in your test print. If you see bulges, but no gap in the wall at all, even at high accelerations, it may be due to disabled Pressure Advance, especially on Bowden extruders. If that is the case, you may need to repeat the print with the PA enabled. It may also be a result of a miscalibrated (too high) filament flow, so it is a good idea to check that too.
fr: Notez l'accélération lorsque l'écart est encore très faible dans votre test d'impression. Si vous voyez des renflements, mais aucun espace dans le mur, même à des accélérations élevées, cela peut être dû à une avance de pression (PA) désactivée, en particulier sur les extrudeurs de type Bowden. Si tel est le cas, vous devrez peut-être répéter l'impression avec le PA activé. Cela peut également être le résultat d'un flux de filament mal calibré (trop élevé), il faut donc vérifier cela aussi.

source: As a note, it may happen - especially at low ringing frequencies - that EI shaper will cause too much smoothing even at lower accelerations. In this case, MZV may be a better choice, because it may allow higher acceleration values.
fr: Notez qu'il peut arriver - en particulier à des fréquences de résonance basses - que l'input shaper EI provoque trop de lissage, même à des accélérations faibles. Dans ce cas, MZV peut être un meilleur choix, car il peut permettre des valeurs d'accélération plus élevées.

source: At very low ringing frequencies (~25 Hz and below) even MZV shaper may create too much smoothing. If that is the case, you can also try to repeat the steps in [Choosing input shaper](#choosing-input-shaper) section with ZV shaper, by using `SET_INPUT_SHAPER SHAPER_TYPE=ZV` command instead. ZV shaper should show even less smoothing than MZV, but is more sensitive to errors in measuring the ringing frequencies.
fr: À des fréquences de résonance très basses (~ 25 Hz et moins), même l'input shaper MZV peut créer trop de lissage. Si tel est le cas, vous pouvez également essayer de répéter les étapes de la section [Choix de l'input shaper](#choosing-input-shaper) avec l'input shaper ZV, en utilisant la commande `SET_INPUT_SHAPER SHAPER_TYPE=ZV` à la place. L'input shaper ZV devrait montrer encore moins de lissage que MZV, mais il est plus sensible aux erreurs de mesure des fréquences de résonance.

source: Another consideration is that if a resonance frequency is too low (below 20-25 Hz), it might be a good idea to increase the printer stiffness or reduce the moving mass. Otherwise, acceleration and printing speed may be limited due too much smoothing now instead of ringing.
fr: Si une fréquence de résonance est trop faible (inférieure à 20-25 Hz), il peut être judicieux d'augmenter la rigidité de l'imprimante ou de réduire la masse en mouvement. Sinon, l'accélération et la vitesse d'impression peuvent être limitées en raison d'un lissage trop important qui remplacera la résonance.

source: Fine-tuning resonance frequencies
fr: Réglage fin des fréquences de résonance
