Repository: z1996xm/BIGTREETECH_translations
Catalog: locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: fr

source: Note that the precision of the resonance frequencies measurements using the ringing test model is sufficient for most purposes, so further tuning is not advised. If you still want to try to double-check your results (e.g. if you still see some ringing after printing a test model with an input shaper of your choice with the same frequencies as you have measured earlier), you can follow the steps in this section. Note that if you see ringing at different frequencies after enabling [input_shaper], this section will not help with that.
fr: Notez que la précision des mesures des fréquences de résonance à l'aide du modèle de test de résonance est suffisante dans la plupart des cas, donc un réglage supplémentaire n'est pas utile. Si vous voulez toujours essayer de revérifier vos résultats (par exemple, si vous voyez toujours une résonance après avoir imprimé un modèle de test avec un input shaper de votre choix avec les fréquences mesurées précédemment), vous pouvez suivre les étapes de cette section. Notez que si vous voyez une résonance à différentes fréquences après avoir activé [input_shaper], cette section ne vous aidera pas.

source: Calculate the necessary parameters for the `TUNING_TOWER` command to tune `shaper_freq_x` parameter as follows: start = shaper_freq_x * 83 / 132 and factor = shaper_freq_x / 66, where `shaper_freq_x` here is the current value in `printer.cfg`.
fr: Calculez les paramètres nécessaires pour que la commande `TUNING_TOWER` règle le paramètre `shaper_freq_x` comme suit : start = shaper_freq_x * 83 / 132 et factor = shaper_freq_x / 66, où `shaper_freq_x` est la valeur indiquée dans `printer.cfg`.

source: Print the test model.
fr: Imprimez le modèle de test.

source: Reset the original frequency value: `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.
fr: Remettez la valeur de fréquence d'origine : `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.

source: Find the band which shows ringing the least and count its number from the bottom starting at 1.
fr: Trouvez la bande résonnant le moins et comptez son numéro à partir du bas en commençant à 1.

source: Calculate the new shaper_freq_x value via old shaper_freq_x * (39 + 5 * #band-number) / 66.
fr: Calculez la nouvelle valeur shaper_freq_x selon la formule : ancien shaper_freq_x * (39 + 5 * #band-number) / 66.

source: Repeat these steps for the Y axis in the same manner, replacing references to X axis with the axis Y (e.g. replace `shaper_freq_x` with `shaper_freq_y` in the formulae and in the `TUNING_TOWER` command).
fr: Répétez ces étapes pour l'axe Y de la même manière, en remplaçant les références à l'axe X par l'axe Y (par exemple, remplacez `shaper_freq_x` par `shaper_freq_y` dans les formules et dans la commande `TUNING_TOWER`).

source: As an example, let's assume you have had measured the ringing frequency for one of the axis equal to 45 Hz. This gives start = 45 * 83 / 132 = 28.30 and factor = 45 / 66 = 0.6818 values for `TUNING_TOWER` command. Now let's assume that after printing the test model, the fourth band from the bottom gives the least ringing. This gives the updated shaper_freq_? value equal to 45 * (39 + 5 * 4) / 66 ≈ 40.23.
fr: A titre d'exemple, supposons que vous ayez mesuré la fréquence de résonance pour l'un des axes à 45 Hz. Cela donne les valeurs start = 45 * 83 / 132 = 28,30 et factor = 45 / 66 = 0,6818 pour la commande `TUNING_TOWER`. Supposons maintenant qu'après l'impression du modèle de test, la quatrième bande à partir du bas donne le moins de résonance. Cela donne le shaper_freq_ mis à jour égal à 45 * (39 + 5 * 4) / 66 ≈ 40,23.

source: After both new `shaper_freq_x` and `shaper_freq_y` parameters have been calculated, you can update `[input_shaper]` section in `printer.cfg` with the new `shaper_freq_x` and `shaper_freq_y` values.
fr: Une fois les deux nouveaux paramètres `shaper_freq_x` et `shaper_freq_y` calculés, vous pouvez mettre à jour la section `[input_shaper]` dans `printer.cfg` avec le nouveau `shaper_freq_x` et `shaper_freq_y`.

source: Pressure Advance
fr: Avance de pression (PA)

source: Unreliable measurements of ringing frequencies
fr: Mesures peu fiables des fréquences de résonance

source: If you are unable to measure the ringing frequencies, e.g. if the distance between the oscillations is not stable, you may still be able to take advantage of input shaping techniques, but the results may not be as good as with proper measurements of the frequencies, and will require a bit more tuning and printing the test model. Note that another possibility is to purchase and install an accelerometer and measure the resonances with it (refer to the [docs](Measuring_Resonances.md) describing the required hardware and the setup process) - but this option requires some crimping and soldering.
fr: Si vous ne parvenez pas à mesurer les fréquences de résonance, par ex. si la distance entre les oscillations n'est pas stable, vous pouvez toujours profiter des techniques de l'input shaper, mais les résultats peuvent ne pas être aussi bons qu'avec des mesures appropriées des fréquences, et nécessiteront un peu plus de réglages et d'impressions du modèle de test. Notez qu'une autre possibilité est d'acheter et d'installer un accéléromètre et de mesurer les résonances avec (reportez-vous à la [documentation](Measuring_Resonances.md) décrivant le matériel requis et le processus de configuration) - mais cette option nécessite quelques soudures et un peu de sertissage.

source: and print the model. Then print the model again, but before printing run instead
fr: et imprimez le modèle. Ensuite, imprimez à nouveau le modèle, mais avant d'imprimer, exécutez à la place

source: Then print the model for the 3rd time, but now run
fr: Imprimez ensuite le modèle pour la 3ème fois, mais exécutez maintenant

source: Essentially, we are printing the ringing test model with TUNING_TOWER using 2HUMP_EI shaper with shaper_freq = 60 Hz, 50 Hz, and 40 Hz.
fr: Dans la pratique nous imprimons le modèle de test de résonance avec TUNING_TOWER en utilisant l'input shaper 2HUMP_EI avec shaper_freq = 60 Hz, 50 Hz et 40 Hz.

source: If none of the models demonstrate improvements in ringing, then, unfortunately, it does not look like the input shaping techniques can help with your case.
fr: Si aucun des modèles ne démontre d'amélioration de la résonance, aucune des techniques d'input shaper ne pourra vous aider.

source: Otherwise, it may be that all models show no ringing, or some show the ringing and some - not so much. Choose the test model with the highest frequency that still shows good improvements in ringing. For example, if 40 Hz and 50 Hz models show almost no ringing, and 60 Hz model already shows some more ringing, stick with 50 Hz.
fr: Sinon, il se peut que tous les modèles n'affichent aucune résonance, ou que certains affichent la résonance et d'autres pas trop. Choisissez le modèle de test avec la fréquence la plus élevée qui montre encore de bonnes améliorations dans la résonance. Par exemple, si les modèles 40 Hz et 50 Hz n'affichent presque aucune résonance et que le modèle 60 Hz affiche déjà un peu plus de résonance, restez à 50 Hz.

source: Now check if EI shaper would be good enough in your case. Choose EI shaper frequency based on the frequency of 2HUMP_EI shaper you chose:
fr: Vérifiez maintenant si l'input shaper EI peut fonctionner dans votre cas. Choisissez la fréquence de l'input shaper EI en fonction de la fréquence de l'input shaper 2HUMP_EI que vous avez choisie :

source: For 2HUMP_EI 60 Hz shaper, use EI shaper with shaper_freq = 50 Hz.
fr: Pour l'input shaper 2HUMP_EI 60 Hz, utilisez l'input shaper EI avec shaper_freq = 50 Hz.

source: For 2HUMP_EI 50 Hz shaper, use EI shaper with shaper_freq = 40 Hz.
fr: Pour l'input shaper 2HUMP_EI 50 Hz, utilisez l'input shaper EI avec shaper_freq = 40 Hz.

source: For 2HUMP_EI 40 Hz shaper, use EI shaper with shaper_freq = 33 Hz.
fr: Pour l'input shaper 2HUMP_EI à 40 Hz, utilisez l'input shaper EI avec shaper_freq = 33 Hz.

source: Now print the test model one more time, running
fr: Imprimez le modèle de test une fois de plus, en exécutant

source: providing the shaper_freq_x=... and shaper_freq_y=... as determined previously.
fr: en fournissant le shaper_freq_x=... et shaper_freq_y=... comme déterminé précédemment.

source: If EI shaper shows very comparable good results as 2HUMP_EI shaper, stick with EI shaper and the frequency determined earlier, otherwise use 2HUMP_EI shaper with the corresponding frequency. Add the results to `printer.cfg` as, e.g.
fr: Si l'input shaper EI montre de bons résultats comparables à ceux de l'input shaper 2HUMP_EI, restez avec l'input shaper EI et la fréquence déterminée précédemment, sinon utilisez l'input shaper 2HUMP_EI avec la fréquence correspondante. Ajoutez les résultats à `printer.cfg` comme, par ex.

source: Continue the tuning with [Selecting max_accel](#selecting-max_accel) section.
fr: Continuez le réglage avec la section [Choix de l'accélération maximale](#selecting-max_accel).

source: Troubleshooting and FAQ
fr: Dépannage et FAQ

source: I cannot get reliable measurements of resonance frequencies
fr: Je n'arrive pas à obtenir de mesures fiables des fréquences de résonance

source: First, make sure it is not some other problem with the printer instead of ringing. If the measurements are not reliable because, say, the distance between the oscillations is not stable, it might mean that the printer has several resonance frequencies on the same axis. One may try to follow the tuning process described in [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) section and still get something out of the input shaping technique. Another possibility is to install an accelerometer, [measure](Measuring_Resonances.md) the resonances with it, and auto-tune the input shaper using the results of those measurements.
fr: En premier lieu, assurez-vous qu'il ne s'agit pas d'un autre problème avec l'imprimante plutôt que de la résonance. Si les mesures ne sont pas fiables parce que, par exemple, la distance entre les oscillations n'est pas stable, cela peut signifier que l'imprimante a plusieurs fréquences de résonance sur le même axe. On peut essayer de suivre le processus de réglage décrit dans la section [Mesures non fiables des fréquences de résonance](#unreliable-measurements-of-ringing-frequencies) et tirer encore quelque chose de la technique de l'input shaper. Une autre possibilité consiste à installer un accéléromètre, à [mesurer](Measuring_Resonances.md) les résonances avec celui-ci et à régler automatiquement l'input shaper en utilisant les résultats de ces mesures.

source: After enabling [input_shaper], I get too smoothed printed parts and fine details are lost
fr: Après avoir activé [input_shaper], j'obtiens des pièces imprimées trop lissées et les détails fins sont perdus

source: Check the considerations in [Selecting max_accel](#selecting-max_accel) section. If the resonance frequency is low, one should not set too high max_accel or increase square_corner_velocity parameters. It might also be better to choose MZV or even ZV input shapers over EI (or 2HUMP_EI and 3HUMP_EI shapers).
fr: Vérifiez les informations dans la section [Choix de l'accélération maximale](#selecting-max_accel). Si la fréquence de résonance est faible, il ne faut pas définir une valeur trop élevée pour max_accel ou augmenter les paramètres square_corner_velocity. Il peut également être préférable de choisir un input shaper de type MZV ou même ZV plutôt que EI (ou des shapers 2HUMP_EI et 3HUMP_EI).

source: After successfully printing for some time without ringing, it appears to come back
fr: Après avoir réussi à imprimer pendant un certain temps sans résonance, elle semble revenir

source: It is possible that after some time the resonance frequencies have changed. E.g. maybe the belts tension has changed (belts got more loose), etc. It is a good idea to check and re-measure the ringing frequencies as described in [Ringing frequency](#ringing-frequency) section and update your config file if necessary.
fr: Il est possible qu'après un certain temps, les fréquences de résonance aient changé. Par exemple. peut-être que la tension des courroies a changé (les courroies sont devenues plus lâches), etc. Il est bon de vérifier et de mesurer à nouveau les fréquences de résonance comme décrit dans la section [Fréquence de résonance](#ringing-frequency) et de mettre à jour votre fichier de configuration si nécessaire .

source: Is dual carriage setup supported with input shapers?
fr: La configuration à double chariot est-elle prise en charge avec l'input shaper ?

source: There is no dedicated support for dual carriages with input shapers, but it does not mean this setup will not work. One should run the tuning twice for each of the carriages, and calculate the ringing frequencies for X and Y axes for each of the carriages independently. Then put the values for carriage 0 into [input_shaper] section, and change the values on the fly when changing carriages, e.g. as a part of some macro:
fr: Il n'y a pas de support dédié pour les doubles chariots avec l'input shaper, mais cela ne signifie pas que cette configuration ne fonctionnera pas. Il faut exécuter le réglage deux fois pour chacun des chariots et calculer les fréquences de résonance des axes X et Y de chacun des chariots indépendamment. Ensuite, placez les valeurs du chariot 0 dans la section [input_shaper] et modifiez les valeurs à la volée lors du changement de chariot, par ex. dans le cadre d'une macro :

source: And similarly when switching back to carriage 0.
fr: Et pareil lors du retour au chariot 0.

source: Does input_shaper affect print time?
fr: input_shaper affecte-t-il le temps d'impression ?

source: No, `input_shaper` feature has pretty much no impact on the print times by itself. However, the value of `max_accel` certainly does (tuning of this parameter described in [this section](#selecting-max_accel)).
fr: Non, la fonctionnalité `input_shaper` n'a pratiquement aucun impact sur les temps d'impression. Cependant, la valeur de `max_accel` en a un (réglage de ce paramètre décrit dans [cette section](#selecting-max_accel)).

source: Technical details
fr: Détails techniques

source: Input shapers used in Klipper are rather standard, and one can find more in-depth overview in the articles describing the corresponding shapers. This section contains a brief overview of some technical aspects of the supported input shapers. The table below shows some (usually approximate) parameters of each shaper.
fr: Les input shaper utilisés dans Klipper sont plutôt standards, et on peut en trouver un aperçu plus détaillé dans les articles décrivant les input shaper correspondants. Cette section contient un bref aperçu de certains aspects techniques des input shapers pris en charge. Le tableau ci-dessous montre certains paramètres (généralement approximatifs) pour chaque input shaper.

source: Shaper <br> duration
fr: Durée de <br> l'input shaper

source: Vibration reduction 20x <br> (5% vibration tolerance)
fr: Réduction des vibrations 20x <br> (5 % de tolérance aux vibrations)

source: Vibration reduction 10x <br> (10% vibration tolerance)
fr: Réduction des vibrations 10x <br> (tolérance aux vibrations de 10 %)

source: A note on vibration reduction: the values in the table above are approximate. If the damping ratio of the printer is known for each axis, the shaper can be configured more precisely and it will then reduce the resonances in a bit wider range of frequencies. However, the damping ratio is usually unknown and is hard to estimate without a special equipment, so Klipper uses 0.1 value by default, which is a good all-round value. The frequency ranges in the table cover a number of different possible damping ratios around that value (approx. from 0.05 to 0.2).
fr: Remarque concernant l'atténuation des vibrations : les valeurs du tableau ci-dessus sont approximatives. Si le taux d'amortissement de l'imprimante est connu pour chaque axe, l'input shaper peut être configuré plus précisément ce qui réduira alors les résonances dans une plage de fréquences un peu plus large. Cependant, le taux d'amortissement est généralement inconnu et difficile à estimer sans équipement spécial. Klipper utilise donc la valeur 0,1 par défaut, ce qui est une bonne valeur globale. Les gammes de fréquences du tableau couvrent un certain nombre de différents rapports d'amortissement possibles autour de cette valeur (environ de 0,05 à 0,2).

source: Also note that EI, 2HUMP_EI, and 3HUMP_EI are tuned to reduce vibrations to 5%, so the values for 10% vibration tolerance are provided only for the reference.
fr: Notez également que EI, 2HUMP_EI et 3HUMP_EI sont réglés pour réduire les vibrations à 5 %, les valeurs pour une tolérance de vibration de 10 % sont fournies uniquement à titre indicatif.

source: **How to use this table:**
fr: **Comment utiliser ce tableau :**

source: Shaper duration affects the smoothing in parts - the larger it is, the more smooth the parts are. This dependency is not linear, but can give a sense of which shapers 'smooth' more for the same frequency. The ordering by smoothing is like this: ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. Also, it is rarely practical to set shaper_freq = resonance freq for shapers 2HUMP_EI and 3HUMP_EI (they should be used to reduce vibrations for several frequencies).
fr: La durée de l'input shaper affecte le lissage des pièces - plus elle est grande, plus les pièces sont lisses. Cette dépendance n'est pas linéaire, mais peut donner une idée des input shapers qui "lissent" le plus pour une même fréquence. L'ordre par lissage est le suivant : ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. De plus, il est rarement pratique de régler shaper_freq = fréquence de résonance des types 2HUMP_EI et 3HUMP_EI (utilisés pour réduire les vibrations sur plusieurs fréquences).

source: One can estimate a range of frequencies in which the shaper reduces vibrations. For example, MZV with shaper_freq = 35 Hz reduces vibrations to 5% for frequencies [33.6, 36.4] Hz. 3HUMP_EI with shaper_freq = 50 Hz reduces vibrations to 5% in range [27.5, 75] Hz.
fr: On peut estimer une gamme de fréquences pour laquelle l'input shaper réduit les vibrations. Par exemple, MZV avec shaper_freq = 35 Hz réduit les vibrations à 5 % pour les fréquences [33,6, 36,4] Hz. 3HUMP_EI avec shaper_freq = 50 Hz réduit les vibrations à 5 % dans la plage [27,5 - 75] Hz.

source: One can use this table to check which shaper they should be using if they need to reduce vibrations at several frequencies. For example, if one has resonances at 35 Hz and 60 Hz on the same axis: a) EI shaper needs to have shaper_freq = 35 / (1 - 0.2) = 43.75 Hz, and it will reduce resonances until 43.75 * (1 + 0.2) = 52.5 Hz, so it is not sufficient; b) 2HUMP_EI shaper needs to have shaper_freq = 35 / (1 - 0.35) = 53.85 Hz and will reduce vibrations until 53.85 * (1 + 0.35) = 72.7 Hz - so this is an acceptable configuration. Always try to use as high shaper_freq as possible for a given shaper (perhaps with some safety margin, so in this example shaper_freq ≈ 50-52 Hz would work best), and try to use a shaper with as small shaper duration as possible.
fr: On peut utiliser ce tableau pour vérifier quel input shaper choisir pour la réduction des vibrations de plusieurs fréquences. Par exemple, si on a des résonances à 35 Hz et 60 Hz sur le même axe : a) EI doit avoir shaper_freq = 35 / (1 - 0.2) = 43.75 Hz, ce qui réduirait les résonances jusqu'à 43.75 * (1 + 0,2) = 52,5 Hz, donc ce n'est pas suffisant ; b) Le 2HUMP_EI doit avoir shaper_freq = 35 / (1 - 0,35) = 53,85 Hz ce qui réduira les vibrations jusqu'à 53,85 * (1 + 0,35) = 72,7 Hz - c'est donc une configuration acceptable. Essayez toujours d'utiliser le plus haut shaper_freq possible pour un input shaper donné (peut-être avec une certaine marge de sécurité, donc dans cet exemple shaper_freq ≈ 50-52 Hz fonctionnerait mieux), et essayez d'utiliser un input shaper avec une durée aussi petite que possible.

source: If one needs to reduce vibrations at several very different frequencies (say, 30 Hz and 100 Hz), they may see that the table above does not provide enough information. In this case one may have more luck with [scripts/graph_shaper.py](../scripts/graph_shaper.py) script, which is more flexible.
fr: Si l'on a besoin de réduire les vibrations de plusieurs fréquences très différentes (par exemple, 30 Hz et 100 Hz), le tableau ci-dessus ne fournit pas suffisamment d'informations. Dans ce cas, on peut avoir plus de chance avec le script [scripts/graph_shaper.py](../scripts/graph_shaper.py), qui est plus flexible.

source: [input_shaper] shaper_freq_x: ... # frequency for the X mark of the test model shaper_freq_y: ... # frequency for the Y mark of the test model
fr: [input_shaper] shaper_freq_x: ... # frequence pour la marque X sur le modèle de test shaper_freq_y: ... # frequence pour la marque Y sur le modèle de test

source: Basic tuning requires measuring the ringing frequencies of the printer by printing a test model.
fr: Le réglage de base nécessite de mesurer les fréquences de résonance de l'imprimante en imprimant un modèle de test.

source: If `square_corner_velocity` parameter was changed, revert it back to 5.0. It is not advised to increase it when using input shaper because it can cause more smoothing in parts - it is better to use higher acceleration value instead.
fr: Si le paramètre `square_corner_velocity` a été modifié, remettez-le à 5.0. Il n'est pas conseillé de l'augmenter lors de l'utilisation de l'input shaper car cela peut provoquer plus de lissage dans les pièces - il est préférable d'utiliser une valeur d'accélération plus élevée à la place.

source: Increase `max_accel_to_decel` by issuing the following command: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
fr: Augmentez `max_accel_to_decel` en lançant la commande suivante : `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`

source: Disable Pressure Advance: `SET_PRESSURE_ADVANCE ADVANCE=0`
fr: Désactivez l'avance de pression : `SET_PRESSURE_ADVANCE ADVANCE=0`

source: Execute the command: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` Basically, we try to make ringing more pronounced by setting different large values for acceleration. This command will increase the acceleration every 5 mm starting from 1500 mm/sec^2: 1500 mm/sec^2, 2000 mm/sec^2, 2500 mm/sec^2 and so forth up until 7000 mm/sec^2 at the last band.
fr: Exécutez la commande : `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` Dans la pratique, nous essayons de rendre la résonance plus prononcée en définissant différentes valeurs élevées pour l'accélération. Cette commande augmentera l'accélération tous les 5 mm à partir de 1500 mm/sec² : 1500 mm/sec², 2000 mm/sec², 2500 mm/sec² et ainsi de suite jusqu'à 7000 mm/sec² pour la dernière bande.

source: Do (8) - (10) for Y mark as well.
fr: Faites (8) - (10) pour la marque Y également.

source: Print the ringing test model as follows:
fr: Imprimez le modèle de test de résonance comme suit :

source: Restart the firmware: `RESTART`
fr: Redémarrez le micrologiciel : `RESTART`

source: Prepare for test: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
fr: Préparez-vous pour le test : `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`

source: Execute: `SET_INPUT_SHAPER SHAPER_TYPE=MZV`
fr: Exécutez : `SET_INPUT_SHAPER SHAPER_TYPE=MZV`

source: Execute the command: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
fr: Exécutez la commande : `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
