Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: fr

source: This endpoint is used to subscribe to Klipper's internal "trapezoid motion queue". Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
fr: Ce point de terminaison est utilisé pour s'abonner à la "file d'attente de mouvements trapézoïdaux" interne de Klipper. L'obtention de ces mises à jour de mouvement de bas niveau peut être utile à des fins de diagnostic et de débogage. L'utilisation de ce point de terminaison peut augmenter la charge système de Klipper.

source: A request may look like: `{"id": 123, "method": "motion_report/dump_trapq", "params": {"name": "toolhead", "response_template":{}}}` and might return: `{"id": 1, "result": {"header": ["time", "duration", "start_velocity", "acceleration", "start_position", "direction"]}}` and might later produce asynchronous messages such as: `{"params": {"data": [[4.05, 1.0, 0.0, 0.0, [300.0, 0.0, 0.0], [0.0, 0.0, 0.0]], [5.054, 0.001, 0.0, 3000.0, [300.0, 0.0, 0.0], [-1.0, 0.0, 0.0]]]}}`
fr: Une requête peut ressembler à : `{"id": 123, "method": "motion_report/dump_trapq", "params": {"name": "toolhead", "response_template":{}}}` et peut renvoyer : `{"id": 1, "result": {"header": ["time", "duration", "start_velocity", "acceleration", "start_position", "direction"]}} ` et peut produire ultérieurement des messages asynchrones tels que : `{"params": {"data": [[4.05, 1.0, 0.0, 0.0, [300.0, 0.0, 0.0], [0.0, 0.0, 0.0] ], [5.054, 0.001, 0.0, 3000.0, [300.0, 0.0, 0.0], [-1.0, 0.0, 0.0]]]}}`

source: This endpoint is used to subscribe to ADXL345 accelerometer data. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
fr: Ce point de terminaison est utilisé pour s'abonner aux données de l'accéléromètre ADXL345. L'obtention de ces mises à jour de mouvement de bas niveau peut être utile à des fins de diagnostic et de débogage. L'utilisation de ce point de terminaison peut augmenter la charge système de Klipper.

source: A request may look like: `{"id": 123, "method":"adxl345/dump_adxl345", "params": {"sensor": "adxl345", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","x_acceleration","y_acceleration", "z_acceleration"]}}` and might later produce asynchronous messages such as: `{"params":{"overflows":0,"data":[[3292.432935,-535.44309,-1529.8374,9561.4], [3292.433256,-382.45935,-1606.32927,9561.48375]]}}`
fr: Une requête peut ressembler à : `{"id": 123, "method":"adxl345/dump_adxl345", "params": {"sensor": "adxl345", "response_template": {}}}` et pourrait renvoyer : `{"id": 123,"result":{"header":["time","x_acceleration","y_acceleration", "z_acceleration"]}}` et pourrait plus tard produire des messages asynchrones messages tels que : `{"params":{"overflows":0,"data":[[3292.432935,-535.44309,-1529.8374,9561.4], [3292.433256,-382.45935,-1606.32927,9561.48375]]}} `

source: This endpoint is used to subscribe to [angle sensor data](Config_Reference.md#angle). Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
fr: Ce point de terminaison est utilisé pour s'abonner aux [données du capteur d'angle](Config_Reference.md#angle). L'obtention de ces mises à jour de mouvement de bas niveau peut être utile à des fins de diagnostic et de débogage. L'utilisation de ce point de terminaison peut augmenter la charge système de Klipper.

source: A request may look like: `{"id": 123, "method":"angle/dump_angle", "params": {"sensor": "my_angle_sensor", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","angle"]}}` and might later produce asynchronous messages such as: `{"params":{"position_offset":3.151562,"errors":0, "data":[[1290.951905,-5063],[1290.952321,-5065]]}}`
fr: Une requête peut ressembler à : `{"id": 123, "method":"angle/dump_angle", "params": {"sensor": "my_angle_sensor", "response_template": {}}}` et peut renvoyer : `{"id": 123,"result":{"header":["time","angle"]}}` et peut produire ultérieurement des messages asynchrones tels que : `{ "params":{"position_offset":3.151562,"errors":0, "data":[[1290.951905,-5063],[1290.952321,-5065]]}}`

source: See the [Moonraker](https://github.com/Arksine/moonraker) project for a popular tool that can forward HTTP requests to Klipper's API Server Unix Domain Socket.
fr: Voir le projet [Moonraker](https://github.com/Arksine/moonraker) pour un outil populaire qui peut transférer les requêtes HTTP vers le socket du serveur d'API de Klipper.
