Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: fr

source: This document describes Klipper's Application Programmer Interface (API). This interface enables external applications to query and control the Klipper host software.
fr: Ce document décrit l'Interface de Programmation d'Applications (API) de Klipper. Cette interface permet à des applications externes d'interroger et de contrôler Klipper.

source: Enabling the API socket
fr: Activer le socket API

source: In order to use the API server, the klippy.py host software must be started with the `-a` parameter. For example:
fr: Pour pouvoir utiliser les Serveur API, le logiciel hôte klippy.py doit être démarré avec le paramètre `-a`. Par exemple :

source: This causes the host software to create a Unix Domain Socket. A client can then open a connection on that socket and send commands to Klipper.
fr: Cela force le logiciel hôte à créer un socket de domaine Unix. Un client peut alors ouvrir une connexion sur ce socket et envoyer des commandes à Klipper.

source: Request format
fr: Format de la demande

source: Messages sent and received on the socket are JSON encoded strings terminated by an ASCII 0x03 character:
fr: Les messages envoyés et reçus sur le socket sont des chaînes au format JSON et terminées par le caractère ASCII 0x03 :

source: Klipper contains a `scripts/whconsole.py` tool that can perform the above message framing. For example:
fr: Klipper contiens un outil `scripts/whconsole.py` qui peut effectuer la mise en forme du message ci-dessus. Par exemple :

source: This tool can read a series of JSON commands from stdin, send them to Klipper, and report the results. The tool expects each JSON command to be on a single line, and it will automatically append the 0x03 terminator when transmitting a request. (The Klipper API server does not have a newline requirement.)
fr: Cet outil peut lire une série de commandes JSON à partir de l'entrée standard stdin, les envoyer à Klipper et afficher les résultats. Cet outil s'attend à avoir une commande JSON par ligne et il ajoute automatiquement le terminateur 0x03 avant d'envoyer les requêtes. (Le serveur d'API de Klipper ne attend pas un saut de ligne.)

source: API Protocol
fr: Protocole de l'API

source: The command protocol used on the communication socket is inspired by [json-rpc](https://www.jsonrpc.org/).
fr: Le protocole de commande utilisé sur le socket de communications est inspiré par [json-rpc](https://www.jsonrpc.org/).

source: A request might look like:
fr: Une requête pourrait ressembler à ça :

source: and a response might look like:
fr: et une réponse pourrait ressembler à ça :

source: Each request must be a JSON dictionary. (This document uses the Python term "dictionary" to describe a "JSON object" - a mapping of key/value pairs contained within `{}`.)
fr: Toutes les requêtes doivent être un dictionnaire JSON. (Ce document utilise le terme Python 'dictionary' pour décrire un objet JSON - une affectation de paires Clé/Valeur comprises en deux parenthèses `{}`.)

source: The request dictionary must contain a "method" parameter that is the string name of an available Klipper "endpoint".
fr: le dictionnaire de requête doit contenir un paramètre "méthode" disponible dans les "points de terminaison" de Klipper.

source: The request dictionary may contain a "params" parameter which must be of a dictionary type. The "params" provide additional parameter information to the Klipper "endpoint" handling the request. Its content is specific to the "endpoint".
fr: Le dictionnaire de requête peut contenir un paramètre "params" qui doit être de type dictionnaire. Les "params" fournissent des informations de paramètre supplémentaires au "endpoint" Klipper qui traite la demande. Son contenu est spécifique au "endpoint".

source: The request dictionary may contain an "id" parameter which may be of any JSON type. If "id" is present then Klipper will respond to the request with a response message containing that "id". If "id" is omitted (or set to a JSON "null" value) then Klipper will not provide any response to the request. A response message is a JSON dictionary containing "id" and "result". The "result" is always a dictionary - its contents are specific to the "endpoint" handling the request.
fr: Le dictionnaire de requête peut contenir un paramètre "id" qui peut être de n'importe quel type JSON. Si "id" est présent, alors Klipper répondra à la demande avec une réponse contenant cet "id". Si "id" est omis (ou défini sur une valeur JSON "null"), Klipper ne fournira aucune réponse à la requête. Un message de réponse est un dictionnaire JSON contenant "id" et "result". Le "résultat" est toujours un dictionnaire - son contenu est spécifique au "endpoint" traitant la demande.

source: If the processing of a request results in an error, then the response message will contain an "error" field instead of a "result" field. For example, the request: `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` might result in an error response such as: `{"id": 123, "error": {"message": "Must home axis first: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`
fr: Si le traitement d'un requête est en erreur, le message de réponse contiendra un champ "error" au lieu de "result". Par exemple, la requête : `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` pourrait retourner une erreur telle que :: `{"id": 123, "error": {"message": "Must home axis first: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`

source: Klipper will always start processing requests in the order that they are received. However, some request may not complete immediately, which could cause the associated response to be sent out of order with respect to responses from other requests. A JSON request will never pause the processing of future JSON requests.
fr: Klipper traite toujours les demandes dans l'ordre de leur réception. Cependant, certaines requêtes peuvent ne pas se terminer immédiatement, ce qui peut entraîner l'envoi de la réponse associée dans le désordre par rapport aux réponses d'autres requêtes. Une requête JSON ne suspend jamais le traitement des requêtes JSON suivantes.

source: Subscriptions
fr: Abonnements

source: Some Klipper "endpoint" requests allow one to "subscribe" to future asynchronous update messages.
fr: Certains "endpoint" de Klipper autorisent un "abonnement" pour de futurs messages asynchrone de mise à jour.

source: For example:
fr: Par exemple :

source: may initially respond with:
fr: Peut répondre dans un premier temps :

source: and cause Klipper to send future messages similar to:
fr: et faire en sorte que Klipper envoie de futurs messages similaires à :

source: A subscription request accepts a "response_template" dictionary in the "params" field of the request. That "response_template" dictionary is used as a template for future asynchronous messages - it may contain arbitrary key/value pairs. When sending these future asynchronous messages, Klipper will add a "params" field containing a dictionary with "endpoint" specific contents to the response template and then send that template. If a "response_template" field is not provided then it defaults to an empty dictionary (`{}`).
fr: Une demande d'abonnement accepte un dictionnaire "response_template" dans le champ "params" de la demande. Ce dictionnaire "response_template" est utilisé comme modèle pour les futurs messages asynchrones - il peut contenir des paires clé/valeur arbitraires. Lors de l'envoi de ces futurs messages asynchrones, Klipper ajoutera un champ "params" contenant un dictionnaire avec un contenu spécifique "endpoint" au modèle de réponse, puis enverra ce modèle. Si un champ "response_template" n'est pas fourni, il s'agit par défaut d'un dictionnaire vide (`{}`).

source: Available "endpoints"
fr: "endpoints" disponibles

source: By convention, Klipper "endpoints" are of the form `<module_name>/<some_name>`. When making a request to an "endpoint", the full name must be set in the "method" parameter of the request dictionary (eg, `{"method"="gcode/restart"}`).
fr: Par convention, les "endpoints" de Klipper sont de la forme `<module_name>/<some_name>`. Lors d'une demande à un "endpoint", le nom complet doit être défini dans le paramètre "method" du dictionnaire de requête (par exemple, `{"method"="gcode/restart"}`).

source: The "info" endpoint is used to obtain system and version information from Klipper. It is also used to provide the client's version information to Klipper. For example: `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`
fr: Le point de terminaison "info" est utilisé pour obtenir des informations sur le système et la version de Klipper. Il est également utilisé pour fournir les informations de version du client à Klipper. Par exemple : `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`

source: If present, the "client_info" parameter must be a dictionary, but that dictionary may have arbitrary contents. Clients are encouraged to provide the name of the client and its software version when first connecting to the Klipper API server.
fr: S'il est présent, le paramètre "client_info" doit être un dictionnaire, mais ce dictionnaire peut avoir un contenu arbitraire. Les clients sont encouragés à fournir le nom du client et sa version logicielle lors de la première connexion au serveur API Klipper.

source: emergency_stop
fr: arrêt d'urgence

source: The "emergency_stop" endpoint is used to instruct Klipper to transition to a "shutdown" state. It behaves similarly to the G-Code `M112` command. For example: `{"id": 123, "method": "emergency_stop"}`
fr: Le point de terminaison "emergency_stop" est utilisé pour demander à Klipper de passer à un état "shutdown". Il se comporte de la même manière que la commande G-Code `M112`. Par exemple : `{"id": 123, "method": "emergency_stop"}`

source: This endpoint allows clients to register methods that can be called from klipper. It will return an empty object upon success.
fr: Ce point de terminaison permet aux clients d'enregistrer des méthodes pouvant être appelées depuis klipper. Il renverra un objet vide en cas de succès.

source: For example: `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}}` will return: `{"id": 123, "result": {}}`
fr: Par exemple : `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}} renverra : `{"id": 123, "result": {}}`

source: The remote method `paneldue_beep` may now be called from Klipper. Note that if the method takes parameters they should be provided as keyword arguments. Below is an example of how it may called from a gcode_macro:
fr: La méthode distante `paneldue_beep` peut désormais être appelée depuis Klipper. Notez que si la méthode prend des paramètres, ils doivent être fournis en tant qu'arguments de mots clés. Voici un exemple de la façon dont il peut être appelé à partir d'un gcode_macro :

source: When the PANELDUE_BEEP gcode macro is executed, Klipper would send something like the following over the socket: `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`
fr: Lorsque la macro gcode PANELDUE_BEEP est exécutée, Klipper enverra ce qui suit sur le socket : `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`

source: This endpoint queries the list of available printer "objects" that one may query (via the "objects/query" endpoint). For example: `{"id": 123, "method": "objects/list"}` might return: `{"id": 123, "result": {"objects": ["webhooks", "configfile", "heaters", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extruder"]}}`
fr: Ce point de terminaison remonte la liste des "objets" disponibles de l'imprimante que l'on peut interroger (via le point de terminaison "objects/query"). Par exemple : `{"id": 123, "method": "objects/list"}` peut renvoyer : `{"id": 123, "result": {"objects": [" webhooks", "configfile", "heaters", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extruder"]}}`

source: This endpoint allows one to query information from printer objects. For example: `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "Printer is ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3051555.377933684}}`
fr: Ce point de terminaison permet de retrouver des informations à partir d'objets de l'imprimante. Par exemple : `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}} }` peut renvoyer : `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "L'imprimante est prête"} , "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3051555.377933684}}`

source: The "objects" parameter in the request must be a dictionary containing the printer objects that are to be queried - the key contains the printer object name and the value is either "null" (to query all fields) or a list of field names.
fr: Le paramètre "objects" dans la requête doit être un dictionnaire contenant des objets de l'imprimante à interroger - la clé contient le nom de l'objet imprimante et la valeur est soit "null" (pour interroger tous les champs) soit une liste de noms de champs.

source: The response message will contain a "status" field containing a dictionary with the queried information - the key contains the printer object name and the value is a dictionary containing its fields. The response message will also contain an "eventtime" field containing the timestamp from when the query was taken.
fr: Le message de réponse contiendra un champ "statut" contenant un dictionnaire avec les informations demandées - la clé contient le nom de l'objet imprimante et la valeur est un dictionnaire contenant ses champs. Le message de réponse contiendra également un champ "eventtime" contenant l'horodatage à partir duquel la requête a été prise.

source: Available fields are documented in the [Status Reference](Status_Reference.md) document.
fr: Les champs disponibles sont documentés dans le document [Référence des états](Status_Reference.md).

source: This endpoint allows one to query and then subscribe to information from printer objects. The endpoint request and response is identical to the "objects/query" endpoint. For example: `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"]}, "response_template":{}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` and result in subsequent asynchronous messages such as: `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`
fr: Ce point de terminaison permet d'interroger puis de s'abonner à des informations provenant d'objets de l'imprimante. La demande et la réponse du point de terminaison sont identiques au point de terminaison "objects/query". Par exemple : `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state "]}, "response_template":{}}}` peut renvoyer : `{"id": 123, "result": {"status": {"webhooks": {"state": "prêt" }, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` et entraîner des messages asynchrones ultérieurs tels que : `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`

source: This endpoint allows one to query available G-Code commands that have a help string defined. For example: `{"id": 123, "method": "gcode/help"}` might return: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`
fr: Ce point de terminaison permet de retrouver les commandes G-Code disponibles qui ont une chaîne d'aide définie. Par exemple : `{"id": 123, "method": "gcode/help"}` peut renvoyer : `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restaurer un état G-Code précédemment enregistré", "PID_CALIBRATE": "Exécuter le test d'étalonnage PID", "QUERY_ADC": "Rapport de la dernière valeur d'une broche analogique", ...}}`

source: This endpoint allows one to run a series of G-Code commands. For example: `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`
fr: Ce point de terminaison permet d'exécuter une série de commandes G-Code. Par exemple : `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`

source: If the provided G-Code script raises an error, then an error response is generated. However, if the G-Code command produces terminal output, that terminal output is not provided in the response. (Use the "gcode/subscribe_output" endpoint to obtain G-Code terminal output.)
fr: Si le script G-Code fourni génère une erreur, une réponse d'erreur est générée. Cependant, si la commande G-Code produit une sortie vers le terminal, cette sortie n'est pas remontée dans la réponse. (Utilisez le point de terminaison "gcode/subscribe_output" pour obtenir la remontée des sortie du terminal G-Code.)

source: If there is a G-Code command being processed when this request is received, then the provided script will be queued. This delay could be significant (eg, if a G-Code wait for temperature command is running). The JSON response message is sent when the processing of the script fully completes.
fr: Si une commande G-Code est en cours de traitement lorsque cette demande est reçue, le script reçu sera mis en file d'attente. Ce délai peut être important (par exemple, si une commande d'attente de température de code G est en cours). Le message de réponse JSON est envoyé lorsque le traitement du script est entièrement terminé.

source: This endpoint allows one to request a restart - it is similar to running the G-Code "RESTART" command. For example: `{"id": 123, "method": "gcode/restart"}`
fr: Ce point de terminaison permet de demander un redémarrage - il est similaire à l'exécution de la commande G-Code "RESTART". Par exemple : `{"id": 123, "method": "gcode/restart"}`

source: As with the "gcode/script" endpoint, this endpoint only completes after any pending G-Code commands complete.
fr: Comme pour le point de terminaison "gcode/script", ce point de terminaison ne se termine qu'après la fin de toutes les commandes G-Code en attente.

source: This is similar to the "gcode/restart" endpoint - it implements the G-Code "FIRMWARE_RESTART" command. For example: `{"id": 123, "method": "gcode/firmware_restart"}`
fr: Ceci est similaire au point de terminaison "gcode/restart" - il implémente la commande G-Code "FIRMWARE_RESTART". Par exemple : `{"id": 123, "method": "gcode/firmware_restart"}`

source: This endpoint is used to subscribe to G-Code terminal messages that are generated by Klipper. For example: `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` might later produce asynchronous messages such as: `{"params": {"response": "// Klipper state: Shutdown"}}`
fr: Ce point de terminaison est utilisé pour s'abonner aux messages du terminal G-Code de Klipper. Par exemple : `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` peut ultérieurement produire des messages asynchrones tels que : ` {"params": {"response": "// État de Klipper : Arrêt"}}`

source: This endpoint is intended to support human interaction via a "terminal window" interface. Parsing content from the G-Code terminal output is discouraged. Use the "objects/subscribe" endpoint to obtain updates on Klipper's state.
fr: Ce point de terminaison est destiné à prendre en charge l'interaction humaine via une interface "fenêtre de terminal". L'analyse du contenu de la sortie du terminal G-Code est déconseillée. Utilisez le point de terminaison "objects/subscribe" pour obtenir des mises à jour sur l'état de Klipper.

source: This endpoint is similar to running the "PRINT_CANCEL" G-Code command. For example: `{"id": 123, "method": "pause_resume/cancel"}`
fr: Ce point final est similaire à l'exécution de la commande G-Code "PRINT_CANCEL". Par exemple : `{"id": 123, "method": "pause_resume/cancel"}`

source: This endpoint is similar to running the "PAUSE" G-Code command. For example: `{"id": 123, "method": "pause_resume/pause"}`
fr: Ce point d'entrée est similaire à l'exécution de la commande G-Code "PAUSE". Par exemple : `{"id": 123, "method": "pause_resume/pause"}`

source: This endpoint is similar to running the "RESUME" G-Code command. For example: `{"id": 123, "method": "pause_resume/resume"}`
fr: Ce point de terminaison est similaire à l'exécution de la commande G-Code "RESUME". Par exemple : `{"id": 123, "method": "pause_resume/resume"}`

source: This endpoint will query the active endpoints and return their status. For example: `{"id": 123, "method": "query_endstops/status"}` might return: `{"id": 123, "result": {"y": "open", "x": "open", "z": "TRIGGERED"}}`
fr: Ce point de terminaison interrogera les fins de course actifs et renverra leur état. Par exemple : `{"id": 123, "method": "query_endstops/status"}` peut renvoyer : `{"id": 123, "result": {"y": "open ", "x": "open", "z": "TRIGGERED"}}`

source: API server
fr: Serveur API

source: This endpoint is used to subscribe to Klipper's internal stepper queue_step command stream for a stepper. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
fr: Ce point de terminaison est utilisé pour s'abonner au flux de commandes interne stepper queue_step de Klipper pour un stepper. L'obtention de ces mises à jour de mouvement de bas niveau peut être utile à des fins de diagnostic et de débogage. L'utilisation de ce point de terminaison peut augmenter la charge système de Klipper.

source: A request may look like: `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` and might return: `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` and might later produce asynchronous messages such as: `{"params": {"first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0], [29573, 2, -8685], [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0], [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`
fr: Une requête peut ressembler à : `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` et peut renvoyer : `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` et peut produire ultérieurement des messages asynchrones tels que : `{"params": {"first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0 ], [29573, 2, -8685], [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0], [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`

source: The "header" field in the initial query response is used to describe the fields found in later "data" responses.
fr: Le champ "en-tête" dans la réponse initiale à la requête est utilisé pour décrire les champs présents dans les réponses "données" ultérieures.
