Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/Exclude_Object.po
Languages: fr

source: Exclude Objects
fr: Exclure des objets

source: The `[exclude_object]` module allows Klipper to exclude objects while a print is in progress. To enable this feature include an [exclude_object config section](Config_Reference.md#exclude_object) (also see the [command reference](G-Codes.md#exclude-object) and [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.)
fr: Le module `[exclude_object]` permet à Klipper d'exclure des objets pendant qu'une impression est en cours. Pour activer cette fonction, incluez une section de configuration [exclude_object](Config_Reference.md#exclude_object) (voir également la [référence de commandes](G-Codes.md#exclude-object) et le fichier [sample-macros.cfg](../config/sample-macros.cfg) pour une macro G-Code M486 compatible Marlin/RepRapFirmware.)

source: Unlike other 3D printer firmware options, a printer running Klipper utilizes a suite of components and users have many options to choose from. Therefore, in order to provide a a consistent user experience, the `[exclude_object]` module will establish a contract or API of sorts. The contract covers the contents of the gcode file, how the internal state of the module is controlled, and how that state is provided to clients.
fr: Contrairement à d'autres options de micrologiciel d'imprimante 3D, une imprimante exécutant Klipper utilise une suite de composants et les utilisateurs ont le choix de nombreuses options. Par conséquent, afin de fournir une expérience utilisateur cohérente, le module `[exclude_object]` établira un contrat ou une sorte d'API. Le contrat couvre le contenu du fichier gcode, la façon dont l'état interne du module est contrôlé, et la façon dont cet état est fourni aux clients.

source: Workflow Overview
fr: Aperçu du flux de travail

source: A typical workflow for printing a file might look like this:
fr: Le flux de travail typique de l'impression d'un fichier peut ressembler à ceci :

source: Slicing is completed and the file is uploaded for printing. During the upload, the file is processed and `[exclude_object]` markers are added to the file. Alternately, slicers may be configured to prepare object exclusion markers natively, or in it's own pre-processing step.
fr: Le tranchage est terminé et le fichier a été téléchargé pour être imprimé. Pendant le téléchargement, le fichier est traité et des marqueurs `[exclude_object]` sont ajoutés au fichier. Alternativement, les trancheurs peuvent être configurés pour préparer les marqueurs d'exclusion d'objets de manière native ou dans leur propre étape de prétraitement.

source: When printing starts, Klipper will reset the `[exclude_object]` [status](Status_Reference.md#exclude_object).
fr: Lorsque l'impression démarre, Klipper réinitialise l'[état](Status_Reference.md#exclude_object) de `[exclude_object]`.

source: When Klipper processes the `EXCLUDE_OBJECT_DEFINE` block, it will update the status with the known objects and pass it on to clients.
fr: Lorsque Klipper traite le bloc `EXCLUDE_OBJECT_DEFINE`, il met à jour l'état avec les objets connus et le transmet aux clients.

source: The client may use that information to present a UI to the user so that progress can be tracked. Klipper will update the status to include the currently printing object which the client can use for display purposes.
fr: Le client peut utiliser ces informations pour présenter une interface à l'utilisateur afin de suivre la progression. Klipper mettra à jour l'état pour inclure l'objet en cours d'impression que le client peut utiliser à des fins d'affichage.

source: If the user requests that an object be cancelled, the client will issue an `EXCLUDE_OBJECT NAME=<name>` command to Klipper.
fr: Si l'utilisateur demande l'annulation d'un objet, le client envoie une commande `EXCLUDE_OBJECT NAME=<name>` à Klipper.

source: When Klipper process the command, it will add the object to the list of excluded objects and update the status for the client.
fr: Lorsque Klipper traite la commande, il ajoute l'objet à la liste des objets exclus et met à jour le statut du client.

source: The client will receive the updated status from Klipper and can use that information to reflect the object's status in the UI.
fr: Le client recevra l'état mis à jour de Klipper et pourra utiliser cette information pour refléter l'état de l'objet dans l'interface utilisateur.

source: When printing finishes, the `[exclude_object]` status will continue to be available until another action resets it.
fr: Une fois l'impression terminée, l'état `[exclude_object]` continuera à être disponible jusqu'à ce qu'une autre action le réinitialise.

source: The GCode File
fr: Le fichier GCode

source: The specialized gcode processing needed to support excluding objects does not fit into Klipper's core design goals. Therefore, this module requires that the file is processed before being sent to Klipper for printing. Using a post-process script in the slicer or having middleware process the file on upload are two possibilities for preparing the file for Klipper. A reference post-processing script is available both as an executable and a python library, see [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).
fr: Le traitement particulier du gcode nécessaire à la prise en charge des objets exclus ne correspond pas aux caractéristiques de conception de départ de Klipper. Par conséquent, ce module exige que le fichier soit traité avant d'être envoyé à Klipper pour l'impression. L'utilisation d'un script de post-traitement dans le trancheur ou le traitement du fichier par un logiciel intermédiaire lors du téléchargement sont deux possibilités pour préparer le fichier pour Klipper. Un script de post-traitement de référence est disponible à la fois comme exécutable et comme bibliothèque python, voir [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).

source: Object Definitions
fr: Définitions des objets

source: The `EXCLUDE_OBJECT_DEFINE` command is used to provide a summary of each object in the gcode file to be printed. Provides a summary of an object in the file. Objects don't need to be defined in order to be referenced by other commands. The primary purpose of this command is to provide information to the UI without needing to parse the entire gcode file.
fr: La commande `EXCLUDE_OBJECT_DEFINE` est utilisée pour fournir un résumé de chaque objet du fichier gcode à imprimer. Elle fournit le résumé d'un objet dans le fichier. Les objets n'ont pas besoin d'être définis pour être référencés par d'autres commandes. Le but principal de cette commande est de fournir des informations à l'interface utilisateur sans avoir à analyser le fichier gcode en entier.

source: Object definitions are named, to allow users to easily select an object to be excluded, and additional metadata may be provided to allow for graphical cancellation displays. Currently defined metadata includes a `CENTER` X,Y coordinate, and a `POLYGON` list of X,Y points representing a minimal outline of the object. This could be a simple bounding box, or a complicated hull for showing more detailed visualizations of the printed objects. Especially when gcode files include multiple parts with overlapping bounding regions, center points become hard to visually distinguish. `POLYGONS` must be a json-compatible array of point `[X,Y]` tuples without whitespace. Additional parameters will be saved as strings in the object definition and provided in status updates.
fr: Les définitions d'objets sont nommées, pour permettre aux utilisateurs de sélectionner facilement un objet à exclure, et des métadonnées supplémentaires peuvent être fournies pour permettre des affichages graphiques d'annulation. Les métadonnées actuellement définies comprennent une coordonnée X,Y `CENTER`, et une liste `POLYGON` de points X,Y représentant un contour minimal de l'objet. Il peut s'agir d'une simple boîte englobante ou d'une coque complexe permettant de visualiser les objets imprimés de manière plus détaillée. En particulier, lorsque les fichiers gcode comprennent plusieurs parties avec des régions limites qui se chevauchent, les points centraux deviennent difficiles à distinguer visuellement. `POLYGONS` doit être un tableau compatible json de points `[X,Y]`( tuples) sans espace. Les paramètres supplémentaires seront enregistrés sous forme de chaînes de caractères dans la définition de l'objet et fournis dans les mises à jour de l'état.

source: All available G-Code commands are documented in the [G-Code Reference](./G-Codes.md#excludeobject)
fr: Toutes les commandes G-Code disponibles sont documentées dans la [Référence G-Code](./G-Codes.md#excludeobject)

source: Status Information
fr: Informations sur le statut

source: The state of this module is provided to clients by the [exclude_object status](Status_Reference.md#exclude_object).
fr: L'état de ce module est fourni aux clients par le statut [exclude_object](Status_Reference.md#exclude_object).

source: The status is reset when:
fr: L'état est réinitialisé lorsque :

source: The Klipper firmware is restarted.
fr: Le microprogramme Klipper est redémarré.

source: There is a reset of the `[virtual_sdcard]`. Notably, this is reset by Klipper at the start of a print.
fr: Il y a une réinitialisation de la `[virtual_sdcard]`. Notamment, ceci est remis à zéro par Klipper au début d'une impression.

source: When an `EXCLUDE_OBJECT_DEFINE RESET=1` command is issued.
fr: Lorsqu'une commande `EXCLUDE_OBJECT_DEFINE RESET=1` est émise.

source: The list of defined objects is represented in the `exclude_object.objects` status field. In a well defined gcode file, this will be done with `EXCLUDE_OBJECT_DEFINE` commands at the beginning of the file. This will provide clients with object names and coordinates so the UI can provide a graphical representation of the objects if desired.
fr: La liste des objets définis est représentée dans le champ d'état `exclude_object.objects`. Dans un fichier gcode bien défini, cela sera fait avec les commandes `EXCLUDE_OBJECT_DEFINE` au début du fichier. Cela fournira aux clients les noms et les coordonnées des objets afin que l'interface utilisateur puisse fournir une représentation graphique des objets si nécessaire.

source: As the print progresses, the `exclude_object.current_object` status field will be updated as Klipper processes `EXCLUDE_OBJECT_START` and `EXCLUDE_OBJECT_END` commands. The `current_object` field will be set even if the object has been excluded. Undefined objects marked with a `EXCLUDE_OBJECT_START` will be added to the known objects to assist in UI hinting, without any additional metadata.
fr: Au fur et à mesure de l'impression, le champ d'état `exclude_object.current_object` sera mis à jour lorsque Klipper traitera les commandes `EXCLUDE_OBJECT_START` et `EXCLUDE_OBJECT_END`. Le champ `current_object` sera activé même si l'objet a été exclu. Les objets non définis marqués d'un `EXCLUDE_OBJECT_START` seront ajoutés aux objets connus pour aider à la mise en place de l'interface utilisateur, sans métadonnées supplémentaires.

source: As `EXCLUDE_OBJECT` commands are issued, the list of excluded objects is provided in the `exclude_object.excluded_objects` array. Since Klipper looks ahead to process upcoming gcode, there may be a delay between when the command is issued and when the status is updated.
fr: Lorsque les commandes `EXCLUDE_OBJECT` sont émises, la liste des objets exclus est fournie dans le tableau `exclude_object.excluded_objects`. Comme Klipper anticipe le traitement du gcode à venir, il peut y avoir un délai entre le moment où la commande est émise et celui où le statut est mis à jour.
