Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/Packaging.po
Languages: pl, pt_br

source: Klipper is somewhat of a packaging anomaly among python programs, as it doesn't use setuptools to build and install. Some notes regarding how best to package it are as follows:
pl: Klipper jest pewną anomalią wśród programów pythonowych, ponieważ nie używa setuptools do kompilacji i instalacji. Niektóre uwagi dotyczące tego, jak najlepiej go zapakować, są następujące:
pt_br: O Klipper é uma espécie de anomalia de empacotamento entre os programas python, pois não usa setuptools para compilar e instalar. Algumas notas sobre a melhor forma de embalá-lo são as seguintes:

source: C modules
pl: Moduły C
pt_br: módulos C

source: Klipper uses a C module to handle some kinematics calculations more quickly. This module needs to be compiled at packaging time to avoid introducing a runtime dependency on a compiler. To compile the C module, run `python2 klippy/chelper/__init__.py`.
pl: Klipper używa modułu C do szybszej obsługi niektórych obliczeń kinematycznych. Moduł ten musi być skompilowany w czasie pakowania, aby uniknąć wprowadzenia zależności runtime od kompilatora. Aby skompilować moduł C, uruchom `python2 klippy/chelper/__init__.py`.
pt_br: O Klipper usa um módulo C para lidar com alguns cálculos cinemáticos mais rapidamente. Este módulo precisa ser compilado no momento do empacotamento para evitar a introdução de uma dependência de tempo de execução em um compilador. Para compilar o módulo C, execute `python2 klippy/chelper/__init__.py`.

source: Compiling python code
pl: Kompilowanie kodu Pythona
pt_br: Compilando código python

source: Many distributions have a policy of compiling all python code before packaging to improve startup time. You can do this by running `python2 -m compileall klippy`.
pl: W wielu dystrybucjach obowiązuje zasada kompilowania całego kodu Pythona przed pakowaniem w celu skrócenia czasu uruchamiania. Możesz to zrobić uruchamiając `python2-m compileall klippy`.
pt_br: Muitas distribuições têm uma política de compilar todo o código python antes do empacotamento para melhorar o tempo de inicialização. Você pode fazer isso executando `python2 -m compileall klippy`.

source: Versioning
pl: Nadawanie wersji
pt_br: Controle de versão

source: If you are building a package of Klipper from git, it is usual practice not to ship a .git directory, so the versioning must be handled without git. To do this, use the script shipped in `scripts/make_version.py` which should be run as follows: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
pl: Jeśli budujesz pakiet Klippera z gita, zwykle nie wysyłasz katalogu .git, więc wersjonowanie musi być obsługiwane bez gita. Aby to zrobić, użyj skryptu dostarczonego w `scripts/make_version.py`, który należy uruchomić w następujący sposób: `python2 scripts/make_version.py NAZWA DISTRONA > klippy/.version`.
pt_br: Se você estiver construindo um pacote do Klipper a partir do git, é prática comum não enviar um diretório .git, portanto, o controle de versão deve ser feito sem o git. Para fazer isso, use o script enviado em `scripts/make_version.py` que deve ser executado da seguinte forma: `python2 scripts/make_version.py SEUDISTRONAME > klippy/.version`.

source: Sample packaging script
pl: Przykładowy skrypt pakowania
pt_br: Exemplo de script de empacotamento

source: Packaging Klipper
pl: Pakowanie Klipper
pt_br: Embalagem Klipper

source: klipper-git is packaged for Arch Linux, and has a PKGBUILD (package build script) available at [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
pl: klipper-git jest spakowany dla Arch Linux i ma PKGBUILD (skrypt budowania pakietu) dostępny w [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper- git).
pt_br: klipper-git é empacotado para Arch Linux, e tem um PKGBUILD (script de construção de pacote) disponível em [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper- git).
