Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/Skew_Correction.po
Languages: fr

source: Software based skew correction can help resolve dimensional inaccuracies resulting from a printer assembly that is not perfectly square. Note that if your printer is significantly skewed it is strongly recommended to first use mechanical means to get your printer as square as possible prior to applying software based correction.
fr: La correction logicielle de l'équerrage peut aider à résoudre les inexactitudes dimensionnelles résultant d'un assemblage d'imprimante qui n'est pas parfaitement d'équerre. Notez que si votre imprimante est considérablement asymétrique, il est fortement recommandé d'utiliser d'abord des moyens mécaniques pour obtenir une imprimante le plus d'équerre possible avant d'appliquer la correction basée sur le logiciel.

source: Print a Calibration Object
fr: Impression d'un objet de calibrage

source: The first step in correcting skew is to print a [calibration object](https://www.thingiverse.com/thing:2563185/files) along the plane you want to correct. There is also a [calibration object](https://www.thingiverse.com/thing:2972743) that includes all planes in one model. You want the object oriented so that corner A is toward the origin of the plane.
fr: La première étape de la correction de l'équerrage consiste à imprimer un [objet d'étalonnage](https://www.thingiverse.com/thing:2563185/files) le long du plan que vous souhaitez corriger. Il existe également un [objet d'étalonnage](https://www.thingverse.com/thing:2972743) qui inclut tous les plans dans un seul modèle. Veuillez à orienter l'objet de sorte que le coin A soit vers l'origine du plan.

source: Take your measurements
fr: Prenez vos mesures

source: Configure your skew
fr: Configurez votre équerrage

source: `SET_SKEW` can be used to configure skew correction for the XY plane.
fr: `SET_SKEW` peut être utilisé pour configurer la correction d'équerrage pour le plan XY.

source: You may also add measurements for XZ and YZ to the gcode:
fr: Vous pouvez également ajouter des mesures pour XZ et YZ au gcode :

source: After this command you will be prompted to issue a `SAVE_CONFIG` gcode to save the profile to persistent storage. If no profile is named `my_skew_profile` then a new profile will be created. If the named profile exists it will be overwritten.
fr: Après cette commande, vous serez invité à saisir un `SAVE_CONFIG` pour enregistrer le profil de manière permanente. Si aucun profil n'est nommé `my_skew_profile` alors un nouveau profil sera créé. Si le profil nommé existe, il sera écrasé.

source: Once you have a saved profile, you may load it:
fr: Une fois que vous avez un profil enregistré, vous pouvez le charger :

source: It is also possible to remove an old or out of date profile:
fr: Il est également possible de supprimer un profil ancien ou obsolète :

source: After removing a profile you will be prompted to issue a `SAVE_CONFIG` to make this change persist.
fr: Après avoir supprimé un profil, vous serez invité à saisir un `SAVE_CONFIG` pour que cette suppression soit sauvegardée.

source: Verifying your correction
fr: Vérification de votre correction

source: After skew_correction has been configured you may reprint the calibration part with correction enabled. Use the following gcode to check your skew on each plane. The results should be lower than those reported via `GET_CURRENT_SKEW`.
fr: Une fois que skew_correction a été configuré, vous pouvez réimprimer l'objet de calibrage avec la correction activée. Utilisez le g-code suivant pour vérifier votre équerrage sur chaque plan. Les résultats devraient être inférieurs à ceux rapportés via `GET_CURRENT_SKEW`.

source: Caveats
fr: Avertissements

source: Due to the nature of skew correction it is recommended to configure skew in your start gcode, after homing and any kind of movement that travels near the edge of the print area such as a purge or nozzle wipe. You may use use the `SET_SKEW` or `SKEW_PROFILE` gcodes to accomplish this. It is also recommended to issue a `SET_SKEW CLEAR=1` in your end gcode.
fr: En raison de la nature de la correction de l'équerrage, il est recommandé de configurer la correction dans votre gcode de démarrage, après la mise à l'origine et après tout type de mouvement qui se déplace près du bord de la zone d'impression, comme une purge ou un essuyage de buse. Vous pouvez utiliser les gcodes `SET_SKEW` ou `SKEW_PROFILE` pour le faire. Il est également recommandé d'émettre un `SET_SKEW CLEAR=1` dans votre gcode final.

source: Skew correction
fr: Correction de l'équerrage

source: Make sure that no skew correction is applied during this print. You may do this by either removing the `[skew_correction]` module from printer.cfg or by issuing a `SET_SKEW CLEAR=1` gcode.
fr: Assurez-vous qu'aucune correction d'équerrage n'est appliquée pendant cette impression. Vous pouvez le faire en supprimant le module `[skew_correction]` du fichier printer.cfg ou en tapant un gcode `SET_SKEW CLEAR=1`.

source: The `[skew_correcton]` module requires 3 measurements for each plane you want to correct; the length from Corner A to Corner C, the length from Corner B to Corner D, and the length from Corner A to Corner D. When measuring length AD do not include the flats on the corners that some test objects provide.
fr: Le module `[skew_correcton]` nécessite 3 mesures pour chaque plan que vous souhaitez corriger ; la longueur du coin A au coin C, la longueur du coin B au coin D et la longueur du coin A au coin D. Lors de la mesure de la longueur AD, n'incluez pas les plats sur les coins fournis par certains objets de test.

source: Make sure `[skew_correction]` is in printer.cfg. You may now use the `SET_SKEW` gcode to configure skew_correcton. For example, if your measured lengths along XY are as follows:
fr: Assurez-vous que `[skew_correction]` est bien dans le fichier printer.cfg. Vous pouvez maintenant utiliser le gcode `SET_SKEW` pour configurer skew_correcton. Par exemple, si vos longueurs mesurées le long de XY sont les suivantes :

source: The `[skew_correction]` module also supports profile management in a manner similar to `[bed_mesh]`. After setting skew using the `SET_SKEW` gcode, you may use the `SKEW_PROFILE` gcode to save it:
fr: Le module `[skew_correction]` prend également en charge la gestion des profils d'une manière similaire à `[bed_mesh]`. Après avoir défini la correction d'équerrage à l'aide du gcode `SET_SKEW`, vous pouvez utiliser le gcode `SKEW_PROFILE` pour l'enregistrer :

source: Keep in mind that it is possible for `[skew_correction]` to generate a correction that moves the tool beyond the printer's boundaries on the X and/or Y axes. It is recommended to arrange parts away from the edges when using `[skew_correction]`.
fr: Gardez à l'esprit qu'il est possible que `[skew_correction]` génère une correction qui déplace l'outil au-delà des limites de l'imprimante sur les axes X et/ou Y. Il est recommandé d'éloigner les pièces des bords lors de l'utilisation de `[skew_correction]`.
