Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: fr

source: This document is a reference of printer status information available in Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display), and via the [API Server](API_Server.md).
fr: Ce document est une référence aux informations de status de l'imprimante dans Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display), et via l'[API Server](API_Server.md).

source: The fields in this document are subject to change - if using an attribute be sure to review the [Config Changes document](Config_Changes.md) when upgrading the Klipper software.
fr: Les champs de ce document sont susceptibles d'être modifiés - si vous utilisez un attribut, veillez à consulter le document [Modifications des configurations](Config_Changes.md) lors de la mise à jour du logiciel Klipper.

source: The following information is available in the [bed_mesh](Config_Reference.md#bed_mesh) object:
fr: Les informations suivantes sont disponibles dans l'objet [cartographie du lit](Config_Reference.md#bed_mesh) :

source: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Information on the currently active bed_mesh.
fr: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix` : informations sur la cartographie du lit actuellement active.

source: configfile
fr: fichier de configuration

source: The following information is available in the `configfile` object (this object is always available):
fr: Les informations suivantes sont disponibles dans l'objet `configfile` (cet objet est toujours disponible) :

source: `settings.<section>.<option>`: Returns the given config file setting (or default value) during the last software start or restart. (Any settings changed at run-time will not be reflected here.)
fr: `settings.<section>.<option>` : Renvoie les paramétrages du fichier de configuration (ou la valeur par défaut) lors du dernier démarrage ou redémarrage du logiciel. (Tout paramètre modifié au moment de l'exécution ne sera pas reflété ici.)

source: `config.<section>.<option>`: Returns the given raw config file setting as read by Klipper during the last software start or restart. (Any settings changed at run-time will not be reflected here.) All values are returned as strings.
fr: `config.<section>.<option>` : Renvoie le paramètre donné du fichier de configuration tel que lu par Klipper lors du dernier démarrage ou redémarrage du logiciel. (Tout paramètre modifié au moment de l'exécution ne sera pas reflété ici.) Toutes les valeurs sont renvoyées sous forme de chaînes.

source: The following information is available in the `display_status` object (this object is automatically available if a [display](Config_Reference.md#display) config section is defined):
fr: Les informations suivantes sont disponibles dans l’objet `display_status` (cet objet est automatiquement disponible si une section de configuration [affichage](Config_Reference.md#display) est définie) :

source: `progress`: The progress value of the last `M73` G-Code command (or `virtual_sdcard.progress` if no recent `M73` received).
fr: `progress` : la valeur de progression de la dernière commande G-Code `M73` (ou `virtual_sdcard.progress` si aucune commande `M73` récente n'a été reçue).

source: `message`: The message contained in the last `M117` G-Code command.
fr: `message` : Le message contenu dans la dernière commande G-Code `M117`.

source: The following information is available in the [endstop_phase](Config_Reference.md#endstop_phase) object:
fr: Les informations suivantes sont disponibles dans l'objet [endstop_phase](Config_Reference.md#endstop_phase) :

source: `last_home.<stepper name>.phase`: The phase of the stepper motor at the end of the last home attempt.
fr: `last_home.<stepper name>.phase` : La phase du moteur pas à pas à la fin de la dernière tentative de retour à l'origine.

source: `last_home.<stepper name>.phases`: The total number of phases available on the stepper motor.
fr: `last_home.<stepper name>.phases` : Le nombre total de phases disponibles sur le moteur pas à pas.

source: `last_home.<stepper name>.mcu_position`: The position (as tracked by the micro-controller) of the stepper motor at the end of the last home attempt. The position is the total number of steps taken in a forward direction minus the total number of steps taken in the reverse direction since the micro-controller was last restarted.
fr: `last_home.<stepper name>.mcu_position` : La position (telle que suivie par le microcontrôleur) du moteur pas à pas à la fin de la dernière tentative de retour à l'origine. La position est le nombre total de pas effectués dans le sens avant moins le nombre total de pas effectués dans le sens inverse depuis le dernier redémarrage du microcontrôleur.

source: fan
fr: ventilateur

source: The following information is available in [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) and [controller_fan some_name](Config_Reference.md#controller_fan) objects:
fr: Les informations suivantes sont disponibles dans les objets [fan](Config_Reference.md#fan), [heater_fan nom_du_ventilateur](Config_Reference.md#heater_fan) et [controller_fan nom_du_ventilateur](Config_Reference.md#controller_fan) :

source: `speed`: The fan speed as a float between 0.0 and 1.0.
fr: `speed` : La vitesse du ventilateur nombre réel entre 0,0 et 1,0.

source: `rpm`: The measured fan speed in rotations per minute if the fan has a tachometer_pin defined.
fr: `rpm` : La vitesse du ventilateur mesurée en rotations par minute si le ventilateur a un tachometer_pin défini (ndt : et si le ventilateur possède un tachymètre).

source: The following information is available in [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) objects:
fr: Les informations suivantes sont disponibles dans les objets [filament_switch_sensor nom_du_détecteur](Config_Reference.md#filament_switch_sensor) :

source: `enabled`: Returns True if the switch sensor is currently enabled.
fr: `enabled` : renvoie True si le détecteur de fin de filament est activé.

source: `filament_detected`: Returns True if the sensor is in a triggered state.
fr: `filament_detected` : renvoie True si le détecteur de fin de filament a détecté la présence d'un filament.

source: The following information is available in [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) objects:
fr: Les informations suivantes sont disponibles dans les objets [filament_motion_sensor nom_du_detecteur](Config_Reference.md#filament_motion_sensor) :

source: `enabled`: Returns True if the motion sensor is currently enabled.
fr: `enabled` : renvoie True si le détecteur de mouvement du filament est activé.

source: The following information is available in the [firmware_retraction](Config_Reference.md#firmware_retraction) object:
fr: Les informations suivantes sont disponibles dans l'objet [firmware_retraction](Config_Reference.md#firmware_retraction) :

source: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: The current settings for the firmware_retraction module. These settings may differ from the config file if a `SET_RETRACTION` command alters them.
fr: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed` : sont les paramètres du module firmware_retraction. Ces paramètres peuvent différer du fichier de configuration si une commande `SET_RETRACTION` les modifie.

source: The following information is available in [gcode_macro some_name](Config_Reference.md#gcode_macro) objects:
fr: Les informations suivantes sont disponibles dans les objets [gcode_macro nom_de_la_macro](Config_Reference.md#gcode_macro) :

source: `<variable>`: The current value of a [gcode_macro variable](Command_Templates.md#variables).
fr: `<variable>` : la valeur actuelle d'une [variable gcode_macro](Command_Templates.md#variables).

source: The following information is available in the `gcode_move` object (this object is always available):
fr: Les informations suivantes sont disponibles dans l'objet `gcode_move` (cet objet est toujours disponible) :

source: `gcode_position`: The current position of the toolhead relative to the current G-Code origin. That is, positions that one might directly send to a `G1` command. It is possible to access the x, y, z, and e components of this position (eg, `gcode_position.x`).
fr: `gcode_position` : La position actuelle de la tête d'outil par rapport à l'origine actuelle du G-Code. C'est-à-dire des positions que l'on pourrait envoyer directement à une commande `G1`. Il est possible d'accéder aux composants x, y, z et e de cette position (par exemple, `gcode_position.x`).

source: `position`: The last commanded position of the toolhead using the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
fr: `position` : la dernière position commandée de la tête d'outil à l'aide du système de coordonnées spécifié dans le fichier de configuration. Il est possible d'accéder aux composantes x, y, z et e de cette position (par exemple, `position.x`).

source: `homing_origin`: The origin of the gcode coordinate system (relative to the coordinate system specified in the config file) to use after a `G28` command. The `SET_GCODE_OFFSET` command can alter this position. It is possible to access the x, y, and z components of this position (eg, `homing_origin.x`).
fr: `homing_origin` : L'origine du système de coordonnées gcode (par rapport au système de coordonnées spécifié dans le fichier de configuration) à utiliser après une commande `G28`. La commande `SET_GCODE_OFFSET` peut modifier cette position. Il est possible d'accéder aux composantes x, y et z de cette position (par exemple, `homing_origin.x`).

source: `speed`: The last speed set in a `G1` command (in mm/s).
fr: `vitesse` : La dernière vitesse définie dans une commande `G1` (en mm/s).

source: `speed_factor`: The "speed factor override" as set by an `M220` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested speed.
fr: `speed_factor` : Le « remplacement du facteur de vitesse » tel que défini par une commande `M220`. Il s'agit d'une valeur à virgule flottante. 1,0 signifie qu'il n'y a pas de dépassement et, par exemple, 2,0 double la vitesse demandée.

source: `extrude_factor`: The "extrude factor override" as set by an `M221` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested extrusions.
fr: `extrude_factor` : le "remplacement du facteur d'extrusion" tel que défini par une commande `M221`. Il s'agit d'une valeur à virgule flottante. 1,0 signifie qu'il n'y a pas de remplacement et, par exemple, 2,0 double le volume d'extrusion demandé.

source: `absolute_coordinates`: This returns True if in `G90` absolute coordinate mode or False if in `G91` relative mode.
fr: `absolute_coordinates` : Cela renvoie True si l'on est en mode de coordonnées absolues `G90` ou False si l'on est en mode relatif `G91`.

source: `absolute_extrude`: This returns True if in `M82` absolute extrude mode or False if in `M83` relative mode.
fr: `absolute_extrude` : Ceci renvoie True si l'on est en mode d'extrusion absolue `M82` ou False si l'on est en mode relatif `M83`.

source: The following information is available in the [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) object:
fr: Les informations suivantes sont disponibles dans l'objet [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) :

source: `is_active`: Returns True if the sensor is currently active.
fr: `is_active` : renvoie True si le capteur est actif.

source: The following information is available for heater objects such as [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed), and [heater_generic](Config_Reference.md#heater_generic):
fr: Les informations suivantes sont disponibles pour les objets de type 'chauffage' tels que [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed) et [heater_generic](Config_Reference.md#heater_generic) :

source: `temperature`: The last reported temperature (in Celsius as a float) for the given heater.
fr: `temperature` : la dernière température indiquée (en degrés Celsius sous forme de nombre réel) pour l'élément chauffant donné.

source: `target`: The current target temperature (in Celsius as a float) for the given heater.
fr: `target` : la température cible actuelle (en degrés Celsius sous forme de nombre réel) pour l'élément chauffant donné.

source: `power`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the heater.
fr: `power` : le dernier réglage de la broche PWM (une valeur comprise entre 0,0 et 1,0) associée à l'élément chauffant.

source: `can_extrude`: If extruder can extrude (defined by `min_extrude_temp`), available only for [extruder](Config_Reference.md#extruder)
fr: `can_extrude` : si l'extrudeuse est à la température minimum de fonctionnement (défini par `min_extrude_temp`), disponible uniquement pour [extruder](Config_Reference.md#extruder)

source: The following information is available in the `heaters` object (this object is available if any heater is defined):
fr: Les informations suivantes sont disponibles dans l'objet `heaters` (cet objet est disponible si un élément chauffant est défini) :

source: `available_heaters`: Returns a list of all currently available heaters by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
fr: `available_heaters` : renvoie une liste de tous les éléments chauffants disponibles par leurs noms de section de configuration complets, par ex. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.

source: `available_sensors`: Returns a list of all currently available temperature sensors by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
fr: `available_sensors` : renvoie une liste de tous les capteurs de température actuellement disponibles par leurs noms de section de configuration complets, par ex. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.

source: The following information is available in the [idle_timeout](Config_Reference.md#idle_timeout) object (this object is always available):
fr: Les informations suivantes sont disponibles dans l'objet [idle_timeout](Config_Reference.md#idle_timeout) (cet objet est toujours disponible) :

source: `state`: The current state of the printer as tracked by the idle_timeout module. It is one of the following strings: "Idle", "Printing", "Ready".
fr: `state` : L'état actuel de l'imprimante tel qu'il est suivi par le module idle_timeout. Il s'agit de l'une des chaînes suivantes : "Idle", "Printing", "Ready".

source: `printing_time`: The amount of time (in seconds) the printer has been in the "Printing" state (as tracked by the idle_timeout module).
fr: `printing_time` : la durée (en secondes) pendant laquelle l'imprimante est restée dans l'état "Impression" (telle que suivie par le module idle_timeout).

source: The following information is available in [mcu](Config_Reference.md#mcu) and [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) objects:
fr: Les informations suivantes sont disponibles dans les objets [mcu](Config_Reference.md#mcu) et [mcu nom_du_mcu](Config_Reference.md#mcu-my_extra_mcu) :

source: `mcu_version`: The Klipper code version reported by the micro-controller.
fr: `mcu_version` : la version du code Klipper remontée par le microcontrôleur.

source: `mcu_build_versions`: Information on the build tools used to generate the micro-controller code (as reported by the micro-controller).
fr: `mcu_build_versions` : informations sur les outils de construction utilisés pour générer le code du microcontrôleur (tel que remonté par le microcontrôleur).

source: `mcu_constants.<constant_name>`: Compile time constants reported by the micro-controller. The available constants may differ between micro-controller architectures and with each code revision.
fr: `mcu_constants.<constant_name>` : Compile les constantes de temps rapportées par le microcontrôleur. Les constantes disponibles peuvent différer entre les architectures de microcontrôleur et à chaque révision de code.

source: `last_stats.<statistics_name>`: Statistics information on the micro-controller connection.
fr: `last_stats.<statistics_name>` : informations statistiques sur la connexion du microcontrôleur.

source: The following information is available in [output_pin some_name](Config_Reference.md#output_pin) objects:
fr: Les informations suivantes sont disponibles dans les objets [output_pin nom_de_la_sortie](Config_Reference.md#output_pin) :

source: `value`: The "value" of the pin, as set by a `SET_PIN` command.
fr: `value` : la "valeur" de la broche, telle que définie par une commande `SET_PIN`.

source: The following information is available in the [palette2](Config_Reference.md#palette2) object:
fr: Les informations suivantes sont disponibles dans l'objet [palette2](Config_Reference.md#palette2) :

source: `ping`: Amount of the last reported Palette 2 ping in percent.
fr: `ping` : montant du dernier ping du "Palette 2" signalé en pourcentage.

source: `remaining_load_length`: When starting a Palette 2 print, this will be the amount of filament to load into the extruder.
fr: `remaining_load_length` : lors du démarrage d'une impression Palette 2, ce sera la quantité de filament à charger dans l'extrudeuse.

source: `is_splicing`: True when the Palette 2 is splicing filament.
fr: `is_splicing` : Vrai lorsque la Palette 2 soude le filament.

source: The following information is available in the [pause_resume](Config_Reference.md#pause_resume) object:
fr: Les informations suivantes sont disponibles dans l'objet [pause_resume](Config_Reference.md#pause_resume) :

source: `is_paused`: Returns true if a PAUSE command has been executed without a corresponding RESUME.
fr: `is_paused` : Renvoie true si une commande PAUSE a été exécutée sans RESUME correspondant.

source: The following information is available in the `print_stats` object (this object is automatically available if a [virtual_sdcard](Config_Reference.md#virtual_sdcard) config section is defined):
fr: Les informations suivantes sont disponibles dans l'objet `print_stats` (cet objet est automatiquement disponible si une section de configuration [virtual_sdcard](Config_Reference.md#virtual_sdcard) est définie) :

source: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Estimated information about the current print when a virtual_sdcard print is active.
fr: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message` : informations estimées sur l'impression en cours lorsqu'une impression virtual_sdcard est active.

source: The following information is available in the [probe](Config_Reference.md#probe) object (this object is also available if a [bltouch](Config_Reference.md#bltouch) config section is defined):
fr: Les informations suivantes sont disponibles dans l'objet [probe](Config_Reference.md#probe) (cet objet est également disponible si une section de configuration [bltouch](Config_Reference.md#bltouch) est définie) :

source: `last_query`: Returns True if the probe was reported as "triggered" during the last QUERY_PROBE command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_PROBE command must be run prior to the macro containing this reference.
fr: `last_query` : renvoie True si la sonde a été signalée comme "déclenchée" lors de la dernière commande QUERY_PROBE. Notez que si cela est utilisé dans une macro, en raison de l'ordre de développement du modèle, la commande QUERY_PROBE doit être exécutée avant la macro contenant cette demande.

source: `last_z_result`: Returns the Z result value of the last PROBE command. Note, if this is used in a macro, due to the order of template expansion, the PROBE (or similar) command must be run prior to the macro containing this reference.
fr: `last_z_result` : Renvoie la valeur du Z de la dernière commande PROBE. Notez que si cela est utilisé dans une macro, en raison de l'ordre d'expansion du modèle, la commande PROBE (ou similaire) doit être exécutée avant la macro contenant cette demande.

source: The following information is available in the `quad_gantry_level` object (this object is available if quad_gantry_level is defined):
fr: Les informations suivantes sont disponibles dans l'objet `quad_gantry_level` (cet objet est disponible si quad_gantry_level est défini) :

source: `applied`: True if the gantry leveling process has been run and completed successfully.
fr: `applied` : Vrai si le processus de nivellement 4 points du portique a été exécuté et terminé avec succès.

source: The following information is available in the `query_endstops` object (this object is available if any endstop is defined):
fr: Les informations suivantes sont disponibles dans l'objet `query_endstops` (cet objet est disponible si au moins une fin de course est définie) :

source: `last_query["<endstop>"]`: Returns True if the given endstop was reported as "triggered" during the last QUERY_ENDSTOP command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_ENDSTOP command must be run prior to the macro containing this reference.
fr: `last_query["<endstop>"]` : renvoie True si l'endstop donné a été signalé comme "déclenché" (triggered) lors de la dernière commande QUERY_ENDSTOP. Notez que si cela est utilisé dans une macro, en raison de l'ordre de développement du modèle, la commande QUERY_ENDSTOP doit être exécutée avant la macro contenant cette demande.

source: The following information is available in [servo some_name](Config_Reference.md#servo) objects:
fr: Les informations suivantes sont disponibles dans les objets [servo some_name](Config_Reference.md#servo) :

source: `printer["servo <config_name>"].value`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the servo.
fr: `printer["servo <config_name>"].value` : le dernier réglage de la broche PWM (une valeur comprise entre 0,0 et 1,0) associée au servo.

source: The following information is available in the `system_stats` object (this object is always available):
fr: Les informations suivantes sont disponibles dans l'objet `system_stats` (cet objet est toujours disponible) :

source: `sysload`, `cputime`, `memavail`: Information on the host operating system and process load.
fr: `sysload`, `cputime`, `memavail` : informations sur le système d'exploitation hôte et la charge du processus.

source: temperature sensors
fr: Capteurs de température

source: The following information is available in
fr: Les informations suivantes sont disponibles dans

source: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d config_section_name](Config_Reference.md#htu21d-sensor), [lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor), and [temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) objects:
fr: objets [BME280 nom_du_capteur](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d nom_du_capteur](Config_Reference.md#htu21d-sensor), [lm75 nom_du_capteur](Config_Reference.md#lm75-temperature-sensor) et [temperature_host nom_du_capteur](Config_Reference.md#host-temperature-sensor) :

source: `temperature`: The last read temperature from the sensor.
fr: `temperature` : La dernière température lue par le capteur.
