Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: fr

source: `humidity`, `pressure`, `gas`: The last read values from the sensor (only on bme280, htu21d, and lm75 sensors).
fr: `humidité`, `pression`, `gaz` : les dernières valeurs lues par le capteur (uniquement sur les capteurs bme280, htu21d et lm75).

source: The following information is available in [temperature_fan some_name](Config_Reference.md#temperature_fan) objects:
fr: Les informations suivantes sont disponibles dans les objets [temperature_fan nom_du_ventilateur](Config_Reference.md#temperature_fan) :

source: `target`: The target temperature for the fan.
fr: `target` : La température cible pour le ventilateur.

source: The following information is available in [temperature_sensor some_name](Config_Reference.md#temperature_sensor) objects:
fr: Les informations suivantes sont disponibles dans les objets [temperature_sensor nom_du_capteur](Config_Reference.md#temperature_sensor) :

source: `measured_min_temp`, `measured_max_temp`: The lowest and highest temperature seen by the sensor since the Klipper host software was last restarted.
fr: `measured_min_temp`, `measured_max_temp` : la température la plus basse et la plus élevée observées par le capteur depuis le dernier redémarrage de Klipper.

source: The following information is available in the `toolhead` object (this object is always available):
fr: Les informations suivantes sont disponibles dans l'objet `toolhead` (cet objet est toujours disponible) :

source: `position`: The last commanded position of the toolhead relative to the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
fr: `position` : la dernière position commandée de la tête d'outil par rapport au système de coordonnées spécifié dans le fichier de configuration. Il est possible d'accéder aux composantes x, y, z et e de cette position (par exemple, `position.x`).

source: `extruder`: The name of the currently active extruder. For example, in a macro one could use `printer[printer.toolhead.extruder].target` to get the target temperature of the current extruder.
fr: `extruder` : le nom de l'extrudeur actuellement actif. Par exemple, dans une macro, on pourrait utiliser `printer[printer.toolhead.extruder].target` pour obtenir la température cible de l'extrudeuse actuelle.

source: `homed_axes`: The current cartesian axes considered to be in a "homed" state. This is a string containing one or more of "x", "y", "z".
fr: `homed_axes` : les axes considérés comme étant dans un état "à l'origine". Il s'agit d'une chaîne contenant un ou plusieurs "x", "y", "z".

source: `axis_minimum`, `axis_maximum`: The axis travel limits (mm) after homing. It is possible to access the x, y, z components of this limit value (eg, `axis_minimum.x`, `axis_maximum.z`).
fr: `axis_minimum`, `axis_maximum` : les limites de déplacement de l'axe (mm) après la mise à l'origine. Il est possible d'accéder aux composantes x, y, z de cette valeur limite (par exemple, `axis_minimum.x`, `axis_maximum.z`).

source: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity`: The current printing limits that are in effect. This may differ from the config file settings if a `SET_VELOCITY_LIMIT` (or `M204`) command alters them at run-time.
fr: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity` : les limites d'impression actuelles en vigueur. Cela peut différer des paramètres du fichier de configuration si une commande `SET_VELOCITY_LIMIT` (ou `M204`) les a modifiées au moment de l'exécution.

source: `stalls`: The total number of times (since the last restart) that the printer had to be paused because the toolhead moved faster than moves could be read from the G-Code input.
fr: `stalls` : Le nombre total de fois (depuis le dernier redémarrage) où l'imprimante a dû être mise en pause parce que la tête d'outil s'est déplacée plus vite que les mouvements ne pouvaient être lus à partir de l'entrée G-Code.

source: The following information is available in the [virtual_sdcard](Config_Reference.md#virtual_sdcard) object:
fr: Les informations suivantes sont disponibles dans l'objet [virtual_sdcard](Config_Reference.md#virtual_sdcard) :

source: `is_active`: Returns True if a print from file is currently active.
fr: `is_active` : renvoie True si une impression à partir d'un fichier est actuellement active.

source: `progress`: An estimate of the current print progress (based of file size and file position).
fr: `progress` : une estimation de la progression de l'impression actuelle (basée sur la taille et la position du fichier).

source: `file_position`: The current position (in bytes) of an active print.
fr: `file_position` : la position actuelle (en octets) d'une impression active.

source: The following information is available in the `webhooks` object (this object is always available):
fr: Les informations suivantes sont disponibles dans l'objet `webhooks` (cet objet est toujours disponible) :

source: `state`: Returns a string indicating the current Klipper state. Possible values are: "ready", "startup", "shutdown", "error".
fr: `state` : renvoie une chaîne indiquant l'état actuel de Klipper. Les valeurs possibles sont : "ready", "startup", "shutdown", "error".

source: `state_message`: A human readable string giving additional context on the current Klipper state.
fr: `state_message` : une chaîne donnant un contexte supplémentaire sur l'état actuel de Klipper.

source: The following information is available in the `z_tilt` object (this object is available if z_tilt is defined):
fr: Les informations suivantes sont disponibles dans l'objet `z_tilt` (cet objet est disponible si z_tilt est défini) :

source: `applied`: True if the z-tilt leveling process has been run and completed successfully.
fr: `applied` : Vrai si le processus de mise à niveau z-tilt a été exécuté et terminé avec succès.

source: The following information is available in [dual_carriage](Config_Reference.md#dual_carriage) on a hybrid_corexy or hybrid_corexz robot
fr: Les informations suivantes sont disponibles dans [dual_carriage](Config_Reference.md#dual_carriage) sur une imprimante de type hybrid_corexy ou hybrid_corexz

source: `mode`: The current mode. Possible values are: "FULL_CONTROL"
fr: `mode` : Le mode actuel. Les valeurs possibles sont : "FULL_CONTROL"

source: `active_carriage`: The current active carriage. Possible values are: "CARRIAGE_0", "CARRIAGE_1"
fr: `active_carriage` : le chariot actif actuel. Les valeurs possibles sont : "CARRIAGE_0", "CARRIAGE_1"

source: `file_path`: A full path to the file of currently loaded file.
fr: `file_path` : un chemin d'accès complet au fichier actuellement chargé.

source: `file_size`: The file size (in bytes) of currently loaded file.
fr: `file_size` : taille (en octets) du fichier actuellement chargé.

source: Status reference
fr: Référence des états

source: The following information is available in the `motion_report` object (this object is automatically available if any stepper config section is defined):
fr: Les informations suivantes sont disponibles dans l'objet `motion_report` (cet objet est automatiquement disponible si une section de configuration 'stepper' est définie) :

source: `live_position`: The requested toolhead position interpolated to the current time.
fr: `live_position` : la position de la tête d'outil demandée interpolée à l'instant T.

source: `live_velocity`: The requested toolhead velocity (in mm/s) at the current time.
fr: `live_velocity` : la vitesse de la tête d'outil demandée (en mm/s) à l'instant T.

source: `live_extruder_velocity`: The requested extruder velocity (in mm/s) at the current time.
fr: `live_extruder_velocity` : la vitesse d'extrusion demandée (en mm/s) à l'instant T.

source: `save_config_pending`: Returns true if there are updates that a `SAVE_CONFIG` command may persist to disk.
fr: `save_config_pending` : renvoie vrai s'il existe des mises à jour en attente qu'une commande `SAVE_CONFIG` peut enregistrer sur le disque.

source: `warnings`: A list of warnings about config options. Each entry in the list will be a dictionary containing a `type` and `message` field (both strings). Additional fields may be available depending on the type of warning.
fr: `warnings` : une liste d'avertissements concernant les options de configuration. Chaque entrée de la liste sera un dictionnaire contenant un champ `type` et `message` (les deux chaînes). Des champs supplémentaires peuvent être disponibles selon le type d'avertissement.

source: tmc drivers
fr: Pilotes TMC

source: The following information is available in [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) objects (eg, `[tmc2208 stepper_x]`):
fr: Les informations suivantes sont disponibles dans les objets [pilote pas à pas TMC](Config_Reference.md#tmc-stepper-driver-configuration) (par exemple, `[tmc2208 stepper_x]`) :

source: `mcu_phase_offset`: The micro-controller stepper position corresponding with the driver's "zero" phase. This field may be null if the phase offset is not known.
fr: `mcu_phase_offset` : la position du moteur pas à pas du microcontrôleur correspondant à la phase "zéro" du pilote. Ce champ peut être nul si le déphasage n'est pas connu.

source: `phase_offset_position`: The "commanded position" corresponding to the driver's "zero" phase. This field may be null if the phase offset is not known.
fr: `phase_offset_position` : La "position commandée" correspondant à la phase "zéro" du driver. Ce champ peut être nul si le déphasage n'est pas connu.

source: `drv_status`: The results of the last driver status query. (Only non-zero fields are reported.) This field will be null if the driver is not enabled (and thus is not periodically queried).
fr: `drv_status` : les résultats de la dernière requête d'état du pilote. (Seuls les champs non nuls sont signalés.) Ce champ sera nul si le pilote n'est pas activé (et n'est donc pas interrogé périodiquement).

source: `run_current`: The currently set run current.
fr: `run_current` : le courant de fonctionnement actuellement défini.

source: `hold_current`: The currently set hold current.
fr: `hold_current` : Le courant de maintien actuellement défini.

source: `Diameter`: The last reading from the sensor in mm.
fr: `Diameter` : La dernière lecture du capteur en mm.

source: `Raw`: The last raw ADC reading from the sensor.
fr: `Raw` : La dernière lecture brute du convertisseur AN du capteur.

source: `profiles`: The set of currently defined profiles as setup using BED_MESH_PROFILE.
fr: `profiles` : l'ensemble des profils actuellement définis tels que configurés à l'aide de BED_MESH_PROFILE.

source: The following information is available in [angle some_name](Config_Reference.md#angle) objects:
fr: Les informations suivantes sont disponibles dans les objets [angle votre_nom](Config_Reference.md#angle) :

source: `temperature`: The last temperature reading (in Celsius) from a tle5012b magnetic hall sensor. This value is only available if the angle sensor is a tle5012b chip and if measurements are in progress (otherwise it reports `None`).
fr: `temperature` : la dernière lecture de température (en degrés Celsius) d'un capteur à effet Hall magnétique de type tle5012b. Cette valeur n'est disponible que si le capteur d'angle est une puce tle5012b et si des mesures sont en cours (sinon il signale `None`).

source: The following information is available for each `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]`, and `[pca9632 led_name]` config section defined in printer.cfg:
fr: Les informations suivantes sont disponibles pour chaque sections `[led nom_des_leds]`, `[neopixel nom_des_leds]`, `[dotstar nom_des_leds]`, `[pca9533 nom_des_leds]` et `[pca9632 nom_des_leds]` définies dans printer.cfg :

source: `color_data`: A list of color lists containing the RGBW values for a led in the chain. Each value is represented as a float from 0.0 to 1.0. Each color list contains 4 items (red, green, blue, white) even if the underyling LED supports fewer color channels. For example, the blue value (3rd item in color list) of the second neopixel in a chain could be accessed at `printer["neopixel <config_name>"].color_data[1][2]`.
fr: `color_data` : une liste de listes de couleurs contenant les valeurs RGBW pour une led de la chaîne. Chaque valeur est représentée par un réel de 0,0 à 1,0. Chaque liste de couleurs contient 4 éléments (rouge, vert, bleu, blanc) même si la LED sous-jacente prend en charge moins de canaux de couleur. Par exemple, la valeur bleue (3e élément de la liste des couleurs) du deuxième neopixel d'une chaîne peut être consultée sur `printer["neopixel <config_name>"].color_data[1][2]`.

source: `save_config_pending_items`: Contains the sections and options that were changed and would be persisted by a `SAVE_CONFIG`.
fr: `save_config_pending_items` : Contient les sections et les éléments qui ont été modifiées et qui peuvent être sauvegardées avec un `SAVE_CONFIG`.

source: The following information is available in the [exclude_object](Exclude_Object.md) object:
fr: Les informations suivantes sont disponibles dans l'objet [exclude_object](Exclude_Object.md) :

source: `objects`: An array of the known objects as provided by the `EXCLUDE_OBJECT_DEFINE` command. This is the same information provided by the `EXCLUDE_OBJECT VERBOSE=1` command. The `center` and `polygon` fields will only be present if provided in the original `EXCLUDE_OBJECT_DEFINE`
fr: `objects` : Un tableau des objets connus tel que fourni par la commande `EXCLUDE_OBJECT_DEFINE`. Il s'agit des mêmes informations fournies par la commande `EXCLUDE_OBJECT VERBOSE=1`. Les champs `center` et `polygon` ne seront présents que s'ils sont fournis dans l'original `EXCLUDE_OBJECT_DEFINE`

source: Here is a JSON sample:
fr: Voici un exemple JSON :

source: `excluded_objects`: An array of strings listing the names of excluded objects.
fr: `excluded_objects` : un tableau de chaînes répertoriant les noms des objets exclus.

source: `current_object`: The name of the object currently being printed.
fr: `current_object` : Le nom de l'objet en cours d'impression.

source: The following information is available in the `manual_probe` object:
fr: Les informations suivantes sont disponibles dans l'objet `manual_probe` :

source: `is_active`: Returns True if a manual probing helper script is currently active.
fr: `is_active` : renvoie True si un script d'assistance de sondage manuel est actuellement actif.

source: `z_position`: The current height of the nozzle (as the printer currently understands it).
fr: `z_position` : La hauteur actuelle de la buse (telle que l'imprimante la situe).

source: `z_position_lower`: Last probe attempt just lower than the current height.
fr: `z_position_lower` : Valeur de la dernière tentative de détection mesurée juste en dessous de la hauteur actuelle.

source: `z_position_upper`: Last probe attempt just greater than the current height.
fr: `z_position_upper` : Valeur de la dernière tentative de détection mesurée juste au dessus de la hauteur actuelle.

source: The following information is available in the `Config_Reference.md#bed_screws` object:
fr: Les informations suivantes sont disponibles dans l'objet `Config_Reference.md#bed_screws` :

source: `is_active`: Returns True if the bed screws adjustment tool is currently active.
fr: `is_active` : Renvoie True si le script de réglage des vis du lit est en cours.

source: `state`: The bed screws adjustment tool state. It is one of the following strings: "adjust", "fine".
fr: `state` : L'état du script de réglage des vis du lit. deux étaIl s'agit de l'une des chaînes suivantes : "adjust", "fine".

source: `current_screw`: The index for the current screw being adjusted.
fr: `current_screw` : le numéro de la vis en cours de réglage.

source: `accepted_screws`: The number of accepted screws.
fr: `accepted_screws` : nombre de vis qui ont été acceptées (ndt donc marquées comme réglées).

source: The following information is available for extruder_stepper objects (as well as [extruder](Config_Reference.md#extruder) objects):
fr: Les informations suivantes sont disponibles pour les objets extruder_stepper (ainsi que les objets [extruder](Config_Reference.md#extruder)) :

source: `pressure_advance`: The current [pressure advance](Pressure_Advance.md) value.
fr: `pressure_advance` : la valeur actuelle de [pressure advance](Pressure_Advance.md).

source: `smooth_time`: The current pressure advance smooth time.
fr: `smooth_time` : Le temps de lissage associé à la valeur de "pressure advance" courante.

source: For Delta printers the `cone_start_z` is the max z height at maximum radius (`printer.toolhead.cone_start_z`).
fr: Pour les imprimantes Delta, le `cone_start_z` est la hauteur z maximale au rayon maximal (`printer.toolhead.cone_start_z`).

source: `info.total_layer`: The total layer value of the last `SET_PRINT_STATS_INFO TOTAL_LAYER=<value>` G-Code command.
fr: `info.total_layer` : La valeur totale de la couche de la dernière commande `SET_PRINT_STATS_INFO TOTAL_LAYER=<value>` G-Code.

source: `info.current_layer`: The current layer value of the last `SET_PRINT_STATS_INFO CURRENT_LAYER=<value>` G-Code command.
fr: `info.current_layer` : la valeur de la couche actuelle de la dernière commande G-Code `SET_PRINT_STATS_INFO CURRENT_LAYER=<valeur>`.

source: The following information is available in the `z_thermal_adjust` object (this object is available if [z_thermal_adjust](Config_Reference.md#z_thermal_adjust) is defined).
fr: Les informations suivantes sont disponibles dans l'objet `z_thermal_adjust` (cet objet est disponible si [z_thermal_adjust](Config_Reference.md#z_thermal_adjust) est défini).

source: `enabled`: Returns True if adjustment is enabled.
fr: `enabled` : renvoie True si le réglage est activé.

source: `temperature`: Current (smoothed) temperature of the defined sensor. [degC]
fr: `température` : Température actuelle (lissée) du capteur défini. (en degrés Centigrades)

source: `measured_min_temp`: Minimum measured temperature. [degC]
fr: `measured_min_temp` : température minimale mesurée. (en degrés Centigrades)

source: `measured_max_temp`: Maximum measured temperature. [degC]
fr: `measured_max_temp` : température maximale mesurée. (En degrés Centigrades)

source: `current_z_adjust`: Last computed Z adjustment [mm].
fr: `current_z_adjust` : dernier ajustement Z calculé (en mm).

source: `z_adjust_ref_temperature`: Current reference temperature used for calculation of Z `current_z_adjust` [degC].
fr: `z_adjust_ref_temperature` : Température de référence actuelle utilisée pour le calcul de Z `current_z_adjust` (En degrés Centigrades).

source: The following information is available in the `screws_tilt_adjust` object:
fr: Les informations suivantes sont disponibles dans l'objet `screws_tilt_adjust` :

source: `error`: Returns True if the most recent `SCREWS_TILT_CALCULATE` command included the `MAX_DEVIATION` parameter and any of the probed screw points exceeded the specified `MAX_DEVIATION`.
fr: `error` : renvoie True si la commande `SCREWS_TILT_CALCULATE` la plus récente incluait le paramètre `MAX_DEVIATION` et que l'un des sondages au niveau des vis de lit dépassait la valeur `MAX_DEVIATION`.

source: `results`: A list of the probed screw locations. Each entry in the list will be a dictionary containing the following keys:
fr: `résultats` : une liste des emplacements des vis de lit sondées. Chaque entrée de la liste est un dictionnaire contenant les clés suivantes :

source: `name`: The name of the screw as specified in the config file.
fr: `name` : le nom de la vis tel qu'il est spécifié dans le fichier de configuration.

source: `x`: The X coordinate of the screw as specified in the config file.
fr: `x` : la coordonnée X de la vis telle que spécifiée dans le fichier de configuration.

source: `y`: The Y coordinate of the screw as specified in the config file.
fr: `y` : la coordonnée Y de la vis telle que spécifiée dans le fichier de configuration.

source: `z`: The measured Z height of the screw location.
fr: `z` : La hauteur Z mesurée à l'emplacement de la vis.

source: `sign`: A string specifying the direction to turn to screw for the necessary adjustment. Either "CW" for clockwise or "CCW" for counterclockwise. The base screw will not have a `sign` key.
fr: `sign` : Une chaîne spécifiant le sens de rotation à visser pour le réglage nécessaire. Soit "CW" pour le sens horaire ou "CCW" pour le sens antihoraire. La vis de base n'aura pas de clé `sign`.

source: `adjust`: The number of screw turns to adjust the screw, given in the format "HH:MM," where "HH" is the number of full screw turns and "MM" is the number of "minutes of a clock face" representing a partial screw turn. (E.g. "01:15" would mean to turn the screw one and a quarter revolutions.)
fr: `adjust` : le nombre de tours de vis pour ajuster la vis, donné au format "HH:MM", où "HH" est le nombre de tours de vis complets et "MM" est le nombre de "minutes d'un cadran d'horloge" représentant un tour de vis partiel. (Par exemple, "01:15" signifierait de tourner la vis d'un tour et quart.)
