Repository: z1996xm/BIGTREETECH_translations
Catalog: docs/locales/*/LC_MESSAGES/Using_PWM_Tools.po
Languages: tr

source: This document describes how to setup a PWM-controlled laser or spindle using `output_pin` and some macros.
tr: Bu doküman, `output_pin` ve bazı makrolar kullanılarak PWM kontrollü bir lazerin veya spindle (freze) motorunun nasıl kurulacağını açıklar.

source: How does it work?
tr: Nasıl çalışıyor?

source: With re-purposing the printhead's fan pwm output, you can control lasers or spindles. This is useful if you use switchable print heads, for example the E3D toolchanger or a DIY solution. Usually, cam-tools such as LaserWeb can be configured to use `M3-M5` commands, which stand for *spindle speed CW* (`M3 S[0-255]`), *spindle speed CCW* (`M4 S[0-255]`) and *spindle stop* (`M5`).
tr: 3D baskı kafasının fan pwm çıkışını yeniden kullanarak lazerleri veya spindle (freze) motorunu kontrol edebilirsiniz. Bu, örneğin E3D takım değiştirici veya kendi tasarımınız olan bir değiştirilebilir baskı kafası kullanıyorsanız kullanışlıdır. Genellikle, LaserWeb gibi CAM araçları, *spinde speed CW* (`M3 S[0-255]`), *spindle speed CCW* (`M4 S[0-255]`) ve *spindle stop* (`M5`) anlamına gelen `M3-M5` komutlarını kullanacak şekilde yapılandırılabilir.

source: **Warning:** When driving a laser, keep all security precautions that you can think of! Diode lasers are usually inverted. This means, that when the MCU restarts, the laser will be *fully on* for the time it takes the MCU to start up again. For good measure, it is recommended to *always* wear appropriate laser-goggles of the right wavelength if the laser is powered; and to disconnect the laser when it is not needed. Also, you should configure a safety timeout, so that when your host or MCU encounters an error, the tool will stop.
tr: **Uyarı:** Lazer kullanırken aklınıza gelebilecek tüm güvenlik önlemlerini alınız! Diyot lazerler genellikle ters bağlantılıdır. Bu, MCU yeniden başlatıldığında, MCU'nun yeniden başlaması için gereken süre boyunca lazerin *tamamen açık* olacağı anlamına gelir. İyi bir ölçüm için, lazere güç veriliyorsa gerekmedikçe lazerin bağlantısını kesmemeniz ve *her zaman* kullandığınız lazerin dalga boyuna uygun lazer gözlüğü takmanız önerilir. Ayrıca, ana makineniz veya MCU'nuz bir hatayla karşılaştığında aracın durması için bir güvenlik zaman aşımı süresi yapılandırmanız gerekmektedir.

source: Current Limitations
tr: Mevcut Sınırlamalar

source: There is a limitation of how frequent PWM updates may occur. While being very precise, a PWM update may only occur every 0.1 seconds, rendering it almost useless for raster engraving. However, there exists an [experimental branch](https://github.com/Cirromulus/klipper/tree/laser_tool) with its own tradeoffs. In long term, it is planned to add this functionality to main-line klipper.
tr: PWM güncellemelerinin ne sıklıkta gerçekleşebileceği konusunda bir sınır mevcuttur. Çok kesin olmakla birlikte, bir PWM güncellemesi yalnızca her 0,1 saniyede bir gerçekleşebilir ve raster gravür işleriniz için kullanılması imkansız bir değerdir. Ancak, bazı konularda ödün vermeniz gerekebilen bir [deneysel branch (dal)](https://github.com/Cirromulus/klipper/tree/laser_tool) mevcuttur. Uzun vadede bu özelliğin main-line Klipper'a entegre edilmesi planlanmaktadır.

source: Commands
tr: Komutlar

source: `M3/M4 S<value>` : Set PWM duty-cycle. Values between 0 and 255. `M5` : Stop PWM output to shutdown value.
tr: `M3/M4 S<value>` : PWM döngüsünü ayarlar. Kullanabileceğiniz değerler 0 ve 255 arasındadır. `M5` : PWM çıkışını kapalı konumdaki değere eşitler.

source: Laserweb Configuration
tr: Laserweb Ayarları

source: If you use Laserweb, a working configuration would be:
tr: Eğer Laserweb kullanıyorsanız, ayarlarınız aşağıdaki gibi olmalıdır:

source: GCODE START: M5 ; Disable Laser G21 ; Set units to mm G90 ; Absolute positioning G0 Z0 F7000 ; Set Non-Cutting speed GCODE END: M5 ; Disable Laser G91 ; relative G0 Z+20 F4000 ; G90 ; absolute GCODE HOMING: M5 ; Disable Laser G28 ; Home all axis TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Disable Laser LASER INTENSITY: S
tr: GCODE START: M5 ; Lazeri durdur G21 ; Ölçü birimini mm'ye ayarla G90 ; Mutlak konumlandırma G0 Z0 F7000 ; Kesmeme hızını ayarla GCODE END: M5 ; Lazeri durdur G91 ; Göreceli konumlandırma G0 Z+20 F4000 ; G90 ; Mutlak konumlandırma GCODE HOMING: M5 ; Lazeri durdur G28 ; Tüm eksenleri hizala TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Lazeri durdur LASER INTENSITY: S

source: Using PWM tools
tr: PWM Araçlarını Kullanmak

source: For an example configuration, see [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
tr: Örnek ayarlar için, [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg)'u ziyaret ediniz.
